[{"frontmatter":{"title":"What process did the Select Board use to determine the water tank sites? ","description":"What process did the Select Board use to determine the water tank sites? ","date":"2025-02-06T00:00:00.000Z","categories":["emails"],"authors":["Laurie Bent"],"tags":["water tanks"],"draft":true},"content":"Submitted by Laurie Bent, Select Board member, Town of Weston\n\nFinding the best sites for the water tanks has been one of the most difficult parts of the water tank replacement process. Early on, the engineers determined that the best locations for the new water tanks were near the top of the same hills that the existing water tanks are on, e.g., Paine's Hill, Doublet Hill, and Cat Rock. These hills have two major advantages for water tanks: they are the highest points in Weston, and they are distributed across the Town, allowing for efficient water delivery to residents. Due to the overwhelming advantages of these three hilltops, no other tank locales were considered.\n\nWhile it was easy to confirm that the existing tanks were already in the best places, picking the exact location for the new tanks at these three hills was a challenge. The existing tanks are located on postage-stamp-sized lots that are not big enough to accommodate a second tank. (In order to have a safe and reliable water system while the new tanks are constructed, the old tanks must remain in service until the new tanks are built.)\n\nFortunately for the Town, all three tanks are adjacent to conservation land. The previous working group, consisting of Select Board member Laurie Bent, Town Manager Leon Gaumond, DPW Director Tom Cullen, as well as other members of DPW staff, and Wright-Pierce engineers Rob Williamson and Amy Coppers, soon understood that the best option for the Town was to site the new tanks on conservation land. However, conservation land is protected under Article 97 of the Massachusetts Constitution. Converting such land to use for water tanks requires a lengthy public process that involves exchanging, or swapping, the conservation land being appropriated as water supply land in return for new conservation land elsewhere in the Town. If the Town wants to take conservation land and use it for water supply purposes, it must follow a careful process called MEPA (short for Massachusetts Environmental Policy Act). The proposed new conservation land, which is currently municipal land, must have an equal or greater value to the land that is being taken out of conservation, measured as acreage, economic value, and conservation value.\n\nThe Select Board held public site walks at each of the three hills in late May and early June, 2023. Participants included neighborhood residents, who had been provided with hand- delivered letters notifying them of the site walk. Other attendees included members of the Select Board, the Town Manager, representatives of DPW, Planning Board, Conservation Commission, Tree Advisory Group, the Town Engineer, and Wright-Pierce. Comments received\nduring the site walks were used to develop criteria for evaluating tank locations based on the comprehensive needs and concerns of the community, including residents as well as Town departments, boards, and committees.\n\nTo meet MEPA requirements, the Town must show that it has no better alternative than to site the tanks on conservation land. The process must take all potential siting alternatives into account. Based on the input it had received from participants at the site walks, Wright-Pierce, in close consultation with the working group and the Conservation Commission, developed an “Alternatives Analysis.” The Alternatives Analysis is a matrix of considerations that had to be balanced in determining the final site for each water tank1.\n\nThe Alternatives Analysis considered competing concerns of impacts to conservation land, impact on residential abutters, engineering challenges, and cost. Minimizing the impact to conservation land that provides wildlife habitat, recreational benefits, and valued landmarks is important. Another consideration is that some abutters may be adversely impacted by a new tank in a slightly different location than the old one; at the same time, a tank location that is better for one abutter may be worse for others. Each particular location presents unique challenges of site preparation, including cut and fill, if the site isn’t level; the requirement that the site be accessible for large machines, how much risk constructing a tank at the site may pose to existing infrastructure, and the difficulty of construction. Cost to construct is another important variable: the Town owes taxpayers a duty to use public funds prudently.\n\nThe Alternatives Analysis quantified these competing considerations so that the sites could be compared. Thirteen concerns were divided into categories and given overall weights:\n\nSubmitted by Laurie Bent, Select Board member, Town of Weston\n\nFinding the best sites for the water tanks has been one of the most difficult parts of the water tank replacement process. Early on, the engineers determined that the best locations for the new water tanks were near the top of the same hills that the existing water tanks are on, e.g., Paine's Hill, Doublet Hill, and Cat Rock. These hills have two major advantages for water tanks: they are the highest points in Weston, and they are distributed across the Town, allowing for efficient water delivery to residents. Due to the overwhelming advantages of these three hilltops, no other tank locales were considered.\n\nWhile it was easy to confirm that the existing tanks were already in the best places, picking the exact location for the new tanks at these three hills was a challenge. The existing tanks are located on postage-stamp-sized lots that are not big enough to accommodate a second tank. (In order to have a safe and reliable water system while the new tanks are constructed, the old tanks must remain in service until the new tanks are built.)\n\nFortunately for the Town, all three tanks are adjacent to conservation land. The previous working group, consisting of Select Board member Laurie Bent, Town Manager Leon Gaumond, DPW Director Tom Cullen, as well as other members of DPW staff, and Wright-Pierce engineers Rob Williamson and Amy Coppers, soon understood that the best option for the Town was to site the new tanks on conservation land. However, conservation land is protected under Article 97 of the Massachusetts Constitution. Converting such land to use for water tanks requires a lengthy public process that involves exchanging, or swapping, the conservation land being appropriated as water supply land in return for new conservation land elsewhere in the Town. If the Town wants to take conservation land and use it for water supply purposes, it must follow a careful process called MEPA (short for Massachusetts Environmental Policy Act). The proposed new conservation land, which is currently municipal land, must have an equal or greater value to the land that is being taken out of conservation, measured as acreage, economic value, and conservation value.\n\nThe Select Board held public site walks at each of the three hills in late May and early June, 2023. Participants included neighborhood residents, who had been provided with hand- delivered letters notifying them of the site walk. Other attendees included members of the Select Board, the Town Manager, representatives of DPW, Planning Board, Conservation Commission, Tree Advisory Group, the Town Engineer, and Wright-Pierce. Comments received\nduring the site walks were used to develop criteria for evaluating tank locations based on the comprehensive needs and concerns of the community, including residents as well as Town departments, boards, and committees.\n\nTo meet MEPA requirements, the Town must show that it has no better alternative than to site the tanks on conservation land. The process must take all potential siting alternatives into account. Based on the input it had received from participants at the site walks, Wright-Pierce, in close consultation with the working group and the Conservation Commission, developed an “Alternatives Analysis.” The Alternatives Analysis is a matrix of considerations that had to be balanced in determining the final site for each water tank1.\n\nThe Alternatives Analysis considered competing concerns of impacts to conservation land, impact on residential abutters, engineering challenges, and cost. Minimizing the impact to conservation land that provides wildlife habitat, recreational benefits, and valued landmarks is important. Another consideration is that some abutters may be adversely impacted by a new tank in a slightly different location than the old one; at the same time, a tank location that is better for one abutter may be worse for others. Each particular location presents unique challenges of site preparation, including cut and fill, if the site isn’t level; the requirement that the site be accessible for large machines, how much risk constructing a tank at the site may pose to existing infrastructure, and the difficulty of construction. Cost to construct is another important variable: the Town owes taxpayers a duty to use public funds prudently.\n\nThe Alternatives Analysis quantified these competing considerations so that the sites could be compared. Thirteen concerns were divided into categories and given overall weights:\n\n1. impacts to conservation land (weighted at 38 points out of 100);\n2. impacts to abutters (weighted at 22 points out of 100);\n3. engineering challenges (weighted at 34 points out of 100);\n4. cost (weighted at 6 points out of 100).\n\nEach site was scored on all criteria, and then compared to the other sites under consideration. (For more information about the weighting process, and the results of the scoring, see the November 27, 2023 Alternatives Analysis.)\n\nNotably, the results of the analysis were not sensitive to different weightings. In the November Alternatives Analysis, the same sites received the highest scores at all three hills (Paine's Hill, Doublet Hill, and Cat Rock) even when the weighting was adjusted to give 50% of the total weight to “impacts to abutters,” or to “impacts to preserved land,” or to “engineering.” The results also held up with weighting divided equally between abutters, conservation land, and engineering.\n\nIn the case of both Doublet Hill and Paine's Hill, the new tanks are proposed to be located further from the nearest residences than the old tanks. This is not to minimize the impact on abutters of new tanks that will be approximately 40 feet higher than the old tanks, but at least the tanks could be located further away from residences than the existing tanks are.\n\nUnfortunately, there is no location at the Cat Rock site that would move the tanks further from all existing residences without impacting the Cat Rock lookout, (immediately north of the existing tank) with its northerly views, since residences surround the Cat Rock hill to the east, south, and west. That is why siting the Cat Rock site has been particularly difficult.2\n\nThe Alternatives Analysis was published on the Town website on November 27, 2023. This analysis included a second site at Cat Rock that was proposed by Mr. Michael Chasan, an abutter. At its meeting on December 5, 2023 the Select Board spent about an hour and a quarter hearing the Wright-Pierce presentation on the analysis, including the adjustments that had been made to minimize impacts to abutters, and discussing the question of tank sites. A second Cat Rock site walk took place on January 5, in response to Mr. Chasan’s dissatisfaction with the two existing Cat Rock alternatives (one of which he had proposed). After the January 5th site walk, Mr. Chasan submitted another Cat Rock site, Alternative #3, which he preferred to Alternative #2 that he had previously identified.\n\nAt its January 23, 2024 meeting, the Select Board spent about 2 hours discussing the Cat Rock siting, including hearing lengthy presentations by Mr. Chasan’s attorney and engineer. During discussion, Mr. Chasan’s Alternative #3 was not viewed favorably, in part because it would encroach on the Cat Rock lookout, was too close to the existing tank for safety during construction, and would cost an additional $1 to $1.5M to construct. In light of the lack of enthusiasm for Alternative #3, the Select Board postponed its vote on the Cat Rock site so that Mr. Chasan could make the case for his previous proposal, Alternative #2. After further discussion on Doublet Hill and Paine's Hill sites, the Select Board voted on these two sites.\n\nThe Select Board took up the Cat Rock siting decision again at its February 27, 2024 meeting. The Select Board discussed Mr. Chasan’s proposed new Alternative #2A (whose location differed slightly from Alternative #2), for nearly two hours, with input from Mr. Chasan’s attorney and engineer as well as from Wright-Pierce and townspeople. After a careful comparison of Alternative Site #1 and Alternative Site #2A, the Select Board voted to approve Alternative Site #1 as the site for the Cat Rock water tank.\n\nWith regard to siting, as with all aspects of the Water Tank process, the Select Board took care to conduct a thoughtful and fair process, as required not just by MEPA but by our duty to be good stewards of the Town’s interests, making sure all perspectives were represented. (Wright- Pierce has been in touch with the MEPA Office throughout the water tank siting process, to ensure that the Town’s process is in accordance with MEPA requirements.) The Select Board’s\nsiting decision at Cat Rock was particularly difficult because it involved weighing competing considerations. At Cat Rock, a site that is better for one abutter is worse for another. Impacts to conservation land, as well as considerations of constructability, safety, and cost had to be taken into account. We did our best to accommodate the competing interests, but at Cat Rock, there is no perfect site. Ultimately, the Town’s need for a safe and functional water system that will serve the entire Town must be the most important consideration of all.\n\nFootnotes:\n\n1 This document is available at westonwatertanks.com. Search for the Document Center link on the right side of the page, and select “tank siting.” Here, among other documents, you will find two analyses that informed the siting process. One Alternatives Analysis is dated November 27, 2023 and is titled “Final Report: Tank Site Alternatives Analysis.” There is also a later alternatives analysis document, dated February 2024, under the header “Weston Water Tanks Meeting.” Note that the February 2024 Alternatives Analysis addresses only the Cat Rock siting location (see footnote below).\n\n2 The Cat Rock siting process required an additional alternatives analysis summarized in the February 24, 2024 document. An abutter at the Cat Rock location had proposed a total of three alternative sites to the one proposed by Wright-Pierce. One of the abutter’s proposed sites was addressed in the November 27, 2023 alternatives analysis. Two additional sites were evaluated in the February 2024 analysis.\n","slug":"2025-02-06-select-board-water-tanks"},{"frontmatter":{"title":"Engage Weston Introduction","description":"Introduction to Engage Weston","date":"2025-02-15T00:00:00.000Z","categories":["emails"],"authors":["Alice Benson"],"tags":["Engage Weston"],"draft":false},"content":"Welcome to **Engage Weston!** We are a new group of Weston resident volunteers dedicated to sharing accurate, transparent, timely information on the issues that directly affect our town.  Whatever the topic, we aim to keep residents informed when making accurate decisions about our future. We are transparent about who we are and our mission. \n\nOur goal is to create a space where residents can access reliable information, ask questions, and get transparent accurate information without bias. In today’s fast-paced environment with the proliferation of information without attribution or accuracy, it's more important than ever to have a trusted source for news and updates that impact us all. We believe that an informed community is a stronger community, and we’re excited to be part of that mission.\n\nJoin us as we build a platform where truth, transparency, and community come together to keep **Weston** thriving. Let's stay connected! www.engageweston.com\n\nWe want to hear from you. Please feel free to email us at info@engageweston.com with comments, suggestions, or a request to be added to our mailing list.\n\nTo a Strong Weston,\n\nAlan Day  \nAlice Benson  \nNancy Piedra  \nTom Timko  \nJeffrey Barz-Snell  \nJohn Hennessey\nNancy Vescuso  \n\nOur email list came from suggestions from our supporters. Please forward our newsletters to others you think would like it as we know our current reach is still a small portion of town residents. To unsubscribe, email us at:  info@engageweston.com.\n","slug":"2025-02-15-engage-intro"},{"frontmatter":{"title":"On Water Tank Special Town Meeting - March 12","description":"On Water Tank Special Town Meeting - March 12","date":"2025-02-17T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"After sponsoring the successful petition campaign in January to call a special town meeting on just the water tank issue, we have been sending emails the last few weeks with updates on the issues and the progress of the Select Board’s efforts to raise outstanding issues and to answer resident questions about the tank project. However, some of you receiving this are new to our list, as supporters have given us addresses of those they think might be interested. So a brief summary.\n\n### Why Does the Tank Issue Matter?\nThe tank issue matters because our amount of water storage is not adequate to assure we can fight fires during very dry periods in the summer, because the tanks are at the end of their service lives with maintenance costs rising, and significant areas of town do not have adequate water pressure for resident use or firefighting. It’ll cost the town a large amount to fix this situation and related pipe improvements, in the range of $43 million coming out of our Water Enterprise Fun and our water rates (not town taxes). It’s an important decision that was not approved at the December town meeting, in our opinion, in part because of lack of public understanding of the issue as well as misinformation being disseminated. This leaves us vulnerable to fires in the summers, and residents at higher elevations with inadequate water pressure.\n\nWe think it’s a problem to have key town decisions made without solid information in everyone’s hands, given we don’t have a newspaper any more and town government doesn’t have a way to push information out to everyone (a PR firm might have helped get the word out better). We are trying to help provide that missing source of information, at least until the Weston Observer newspaper (https://westonobserver.org/) is up and running. Our first focus is on the water tank issue in preparation for the March 12 town meeting. Then the May annual town meeting will include our annual budget and other important issues needing clarity like the MBTA 3a multifamily zoning issue. We assume more issues will follow.\n\nThe news in this newsletter issue mostly covers the February 12 Select Board’s Water Tank Working Group meeting, mainly describing how it would be financed. While apparently it was always the plan, the financing strategy was new and surprising to us given the many rumors floating around and our apparent lack of knowledge. The headline for that meeting is below.\n### New Water Tanks Won’t Cost Taxpayers \n#### Third  Water Tank Working Group Meeting Outlines Finances\n\nThe big takeaway from the Wednesday February 12th meeting of the working group is that nearly all the costs of the project will be sourced from the Water System Enterprise Fund, a separate fund that receives water rate revenue and finances all water operations. Select Board Chairman, Tom Palmer, outlined in detail how the replacement project would be funded showing projected revenue from water rate charges and borrowing payments using both state subsidized rates (State Revolving Fund (SRF) for water projects at 2.4%) or at market rates for municipal debt if Weston’s application to the SRF isn’t accepted . Both scenarios showed that nearly all costs could be covered either through use of existing rates and drawing on the Water Enterprise Fund, or, in the case of of market rate debt, with a water rate increase of 1-2% over the 30 year term of the anticipated borrowing. No increase in town taxes will result from this project. The detailed analysis can be found on the town’s website at:\n\nhttps://docs.google.com/spreadsheets/d/1I0zyTkHhg9UZZurXYKF4nPiPygAU8sKd/edit?gid=1029717948#gid=1029717948 \n\n**A video of this Feb 12 meeting** covering mostly finances is at: https://cloud.castus.tv/vod/weston/video/67ace45617f4490008e9615f?page=HOME\n\n**The January 29 meeting** video is at: https://cloud.castus.tv/vod/weston/video/679a720cfaf2120008371eb5?page=HOME This covered how they would proceed and discussed a number of resident questions.\n\n**The February 5th meeting** video covering the design of the tanks (how high and some site issues) is at: https://cloud.castus.tv/vod/weston/video/67a3c2521a72c40008c96280?page=HOME \n\n### Resident Questions Are Answered\nSeveral residents asked questions about whether the tanks needed to be as high as the preliminary design suggests (40 feet taller), and also about the site selections. The Wright-Pierce engineering firm working with the town on this project has answered questions from Tricia Liu, Frank Caine, Bill Rousseau, Lorraine Alexander and the Weston Board of Health in writing, and they are posted on the town’s website at:\n\nhttps://drive.google.com/drive/folders/1CmotMCV3pdT8hkCwnIp_0WPl55lDkLcg\n\n**If you have any questions, send them to the Town Manager, Leon Gaumond** at: gaumond.l@westonma.gov.  Leon will submit them to the Select Board Water Tank Working Group and the engineering firm for a response.\n\n**THIS IS YOUR CHANCE FOR ANSWERS.  DON’T POP UP NEW QUESTIONS IN OR JUST BEFORE TOWN MEETING!!!**  That’s not an honest effort at answers, just an effort at confusing the issue, in our humble opinion.\n\nHOWEVER, in order to not ask questions that have been repeatedly asked and answered, PLEASE check out the huge amount of information the project has generated already. It’s a bit hard to sort through it all, but key sections are the **Frequently Asked Questions (FAQ)** on the main page https://www.westonma.gov/1828/Water-Tank-Replacement-Project\n\nOne very useful document that covers a lot of the design and site questions is at: https://drive.google.com/drive/folders/1-qhNI5-G7UUmXvsFLFvCZ9gAo7E20KX4 under the name of “**Final Tank Site Alteratives Analysis**”, in particular pages 10-15.\n\nAnd check out the Project Document Center document repository FAQ’s at: https://drive.google.com/drive/folders/1y9sX16rdFoOVhIX-AQ7Te5RbZlY1TElQ\n\nA lot is there, probably anything you might want. But we find it’s hard to find things if you have a specific question. Some professional PR help might make it easier to use.\n\n### Where Are We On the 3 Special Town Meeting Articles?\nThere are three articles, and they seem solid in our opinion, though there are still a few people with questions and some not happy with the sites. The project is essentially at a stand still right now, with the whole town inadequately protected with water volumes and pressure to fight fires reliably, be confident aging tanks won’t cause problems, or supply adequate pressure to many residents because the tanks are not high enough. The designers can’t work further until the town approves the possible locations, the upper limit to the height of the tanks, and approves the project’s ability to borrow money for the project when the time comes to do so.\n\n#### Height of the tanks – Amend Zoning By-laws – Municipal Utility Structure Standards\n- One article asks for a zoning change to allow the new tanks to be built up to 40 feet higher. It doesn’t decide the height, that will be firmly decided during the detailed design phases which can only start after these articles are passed. The preliminary design suggested the system would likely need the extra 40 ft to work properly to meet fire fighting needs and pressure standards, but current zoning bylaws don’t allow structures in town to reach that height, so a bylaw change is needed to allow up to that height in the final design, if final design confirms the need.\n#### Land Swap – Authorize Land Exchange for Water Tanks Project and Filing of Article 97 Legislation \n- One article requests approval for a land swap. The current tanks are surrounded by conservation land, and the town needs to use some of that land for the new tanks since the new tanks need to be built while the old ones continue to work. Conservation land is controlled by state law and that law requires the town to set aside new equally valuable and usable land into conservation status if it is to be allowed by the state to take some land out of conservations status to build the new tanks. The plan is to leave the old sites open to public use, just as with the conservation land, but not under the control of the state.\n#### Financing – Appropriate For Water Tank Improvements\n- The final article authorizes the town to borrow up to a set amount when the project needs to spend the money. Current estimates are around $43 million. Without that authorization some planning expenses can’t be funded and bids from contractors can’t be acquired to fix the final cost of the project (firms won’t bother to bid if a project has no funding approval). This borrowing will be repaid mainly out of the water rates and the town’s Water Enterprise Fund, a fund receiving water revenue and which includes a set aside for capital water projects like this. No tax increases will result from this project, so the project will not compete with other possible projects like firehouses or schools for funding out of tax revenues.\n\nWe think all three articles are appropriate and worthy of passage. The Land Swap article does fix the site selection to define the town’s request the necessary state land swap approval, but the height bylaw and the financing authority articles make it possible to continue the planning process, with the final design to be fixed during later design phases (all of which will be public since they need approval by the select board in public sessions). We need approval of the financing article to attract cost bids to finalize the borrowing amounts, and to apply for low interest rates from the state’s water revolving fund. The final exact borrowing figure will be set after final design and bids, and drawing down funds are projected in detail, with current estimates, in the financial spreadsheet made available at: https://docs.google.com/spreadsheets/d/1I0zyTkHhg9UZZurXYKF4nPiPygAU8sKd/edit?gid=1029717948#gid=1029717948.\n\nWe’ve got a few more weeks to get answers to all our questions, as well as to influence the final articles we will consider at the Special Town Meeting. Please stay tuned for honest information about the decision.\n\nSee you March 12 at the high school to vote on this issue. Let’s not let the adequacy of our water supply continue to be a risk for the town.\n\n","slug":"2025-02-17-water-tanks"},{"frontmatter":{"title":"Last Chance To Influence Water Tank Project and Know What It Will Cost","description":"Last Chance To Influence Water Tank Project and Know What It Will Cost","date":"2025-02-25T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"### False: Special Town Meeting Asking for Blank Check\n#### True: Water Rates Will Pay for Nearly All Tank Upgrade Costs, With Minimal Increases\n\n##### Blank Check?\n\nThe Select Board Water Tank Working Group hasn’t finalized the actual number that will be requested at the Special Town Meeting (STM), though we can assume this working figure will be close to the figure discussed previously of around $43m, if nothing big changes in their thinking. The funding article in the warrant book has no dollar figure, since the article language in the petition for a Special Town Meeting  (STM) needed to be set well before the working group dealt with the issue. This was the case in December as well as the article had no dollar amount, but did include an explanation with the figure. \n\nAt the town meeting the article will be introduced for consideration and a verbal motion will be made and shown on the screen and in handouts before the meeting which will include the final number the Select Board Water Tank Working Group recommends shortly. No one is requesting a blank check, as some uniformed people have claimed. The vote will be on authorization of a specific dollar amount to borrow. This is how it was handled in December, though they had an explanation in the warrant book because they had decided on the number well enough in advance to put it in the warrant book. This time we’re waiting for the working group to decide and will introduce that number in the motion to consider the article which the Select Board will have voted on before the STM. At the STM here will be an introduction of the article as presented in the warrant, and then a motion to request a vote that will include a specific dollar amount, and then open discussion before a vote is taken. All above board and fully transparent, though the process was not described fully in advance and allowed some confusion to arise.\n\n##### Where Is the Money Coming From?\n\nThis is the part of the Select Board’s water tank project financial spreadsheet that shows where the funding will come from. The two lines in the spreadsheet that are relevant are at the bottom, funding coming from the WEF (Water Enterprise Fund), and Town Borrowing (funds that would be repaid with taxes, not water rate fees). As the text of our last post said, it was a pleasant surprise for those of us new to the deeper details of this project that the town wisely had set up a fund into which a bit of all of our water rate payments was deposited to cover future capital project costs, like this project. This WEF will subsidize the loan payments to the point that any water rate increases will be very small. Some past tax money is probably included in the Free Cash line, though that could come from other sources and it’s not specified. The very biggest source of funding for the borrowing comes from past and future water rate payments funneled through the WEF. ZERO funds from taxes (Town Borrowing) are devoted to making the debt payments.\n\nThe impact on water rates isn’t clear to us from the spreadsheet, but in the hearing on the topic in the Water Tank Working Group, the possible increases were low, in the 1-2% in the case of state supported water project borrowing, or 3-5% if we borrow at market rates, as I recall. No tax increases will result from the project. The full spreadsheet is at: https://docs.google.com/spreadsheets/d/1I0zyTkHhg9UZZurXYKF4nPiPygAU8sKd/edit?gid=1029717948#gid=1029717948\n\nIf you have questions or concerns, the last opportunity to air them with the Select Board Working Group is tomorrow, Wednesday February 25 at 8:00 am at town hall and on zoom at: https://us02web.zoom.us/j/83995368513\n\nSincerely,\nAlanDay@engageweston.com\n","slug":"2025-02-25-water-tanks"},{"frontmatter":{"title":"FinCom Unanimously Approved Water Tank Articles For Special Town Meeting March 12","description":"FinCom Unanimously Approved Water Tank Articles For Special Town Meeting March 12","date":"2025-03-03T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"Thursday evening Feb 27 Tom Palmer, Select Board Chair, presented the financial plan for the water tank project to the Finance Committee. He reviewed the spreadsheet used by the Water Tank Working Group to describe the cost estimates and funding sources for the project, including the borrowing strategy and likely water rate increases.\n\nTom also reviewed the Select Board’s strategy for dividing the financial motions during the Special Town Meeting into two sections. First, a motion would be offered to fund the remaining engineering design work and to hire an Owners Project Manager (OPM) to help manage the project and assure the design consultants’ work is top notch. This motion will request approximately $3M from the existing town free cash, so the vote will require only a majority vote to pass. The second motion that will be offered will be to authorize up to approximately $38.5M, with up to $37M to be borrowed to fund the construction work. The spreadsheet Tom Palmer showed to the FinCom is at:\n\nhttps://docs.google.com/spreadsheets/d/1I0zyTkHhg9UZZurXYKF4nPiPygAU8sKd/edit?gid=1029717948#gid=1029717948\n\nThe Finance Committee voted unanimously to support the project and all 4 motions that will be offered during the Special Town Meeting. Those motions will be: 1) to authorize the town to confirm the sites for the project and perform a land swap to use some conservation land for the tanks and add new conservation land elsewhere in town to replace the land used by the new tanks, 2) allow the tanks to be built up to a height higher than current zoning allow on those specific 3 sites and with only municipal communication antennas for fire, police and water tank monitoring (no cell towers), 3) for the final design work and the OPM as described above, and 4) for the construction funding and borrowing authorization as described above.\n","slug":"2025-03-02-fincom"},{"frontmatter":{"title":"Water Tank Funding Plan Changes","description":"Water Tank Funding Plan Changes","date":"2025-03-03T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"### $43M Article Split Into 2 Votes, Design and OPM, and Construction Funding \n#### Summary \n\nOn Wednesday morning Feb 26 the Select Board Water Tank Working Group decided it wants the tank funding article voted on in two stages on town meeting night.  The Working Group has put in a profound amount of work over the last several months to address the issues that were raised at the December Town Meeting and to re-shape the proposal into something significantly better. Rather than putting the remaining design funding together with the newly added Owners Project Manager (OPM) oversight function, as well as construction funding in one vote, they decided to ask for separate votes. The first funding vote will be for the design and the OPM first ($3m). Then there will be a separate vote for borrowing for construction funding later in the meeting (up to $37M in debt).\n\nThe impact of this is those residents concerned about oversight of the design process now can rely on a second opinion in the qualified, third-party engineer hired as an OPM who will review the creation of the detailed construction documents and design based on the preliminary conceptual designs. This will allow more opportunity for  resident input during that process. The design will be funded through completion of the construction and bidding documents, so the project can continue. This first vote only needs a majority of the votes to pass as the money will not be borrowed but sourced from available funds. \n\nThe second vote will be to authorize up to $38.5M in expenditures with up to $37M allowed to be borrowed and will require a 2/3 vote. \n\nAs background, the design work funded by the first part of article 3 needs decisions from the town on Articles 1 and 2, the land swap to enable use of the sites selected, and the change in zoning for water tanks on those sites to allow for the increase height necessary to produce the water pressure using gravity to finally give many residents the pressure they want, and the pressure and volume of stored water to meet firefighting needs in very dry periods of high water use. Without knowing those two parameters the engineers can’t know how to design the tanks, so progress will stop very quickly.\n\n#### The Rest of the Story\n\nLast December the funding article asked for a single vote requesting borrowing authority for $43 million to cover both design work to finish the engineering work, and for construction. The votes nearly approved the article, receiving 62% of the 66.6% needed to approve borrowing by the town.\n\nThis time the Select Board is requesting a vote first on just design and to fund a consultant called an Owners Project Manager (OPM) to help the select board manage the project and to assure the engineering consultants work is accurate and well done.\n\nThey propose to pay for this phase of the project with money already available in a “Free Cash” account. This will need only a majority vote, not the 2/3 vote needed for borrowing authority. Passing this motion will allow the project to keep moving forward no matter what happens with the construction borrowing vote. The timing of a later construction funding vote is quite complicated as once each year the town can submit an application to compete for state funds for municipal water projects and the construction funding needs to authorized before the application could be approved, The state funds (State Water Revolving Fund) would allow Weston to finance debt for the project at 2.4% as opposed to market rate municipal bonds. At 2.4% the SBWG estimates water users on average will see a 3% increase in water rates. At market rate municipal bond costs the rates are estimated to rise 5%. Even with either rate increases our rates are lower than many communities in the region, though we charge higher rates for the very big water users and I haven’t heard how those compare. The bigger users could of course use less water to lower their costs, or move to well water for irrigation rather than drinking water.\n\nAfter the first funding vote, the Select Board is asking for approval for borrowing authority to pay for construction, like in December, but for a smaller amount as the design work has been split out.\n\nTo complicate the explanation of all this (sorry for the long and winding road here) the town meeting funding article as written does not specify any amounts, but the amounts are to be specified in the verbal motion in town meeting to consider the article. This was also the case in December. This flexibility to define the vote details in the verbal motion will allow the motion to be split in two votes as described above.\n\nA final twist is that Alan Day will be making all the motions, not the Select Board, because these articles were proposed by our petition drive for consideration during this Special Town Meeting (STM).  We are using our authority as petitioners who called the STM to present only motions that reflect what the Select Board Water Tank Working Group defined as its strategy, not what we or anyone else thinks might be better. We believe those elected to make these decisions for the town, and to manage the implementation of those decisions, are the ones who are best positioned to guide the town through this project.\n\nA final twist is that Alan Day will be making all the motions, not the Select Board, because these articles were proposed by our petition drive for consideration during this Special Town Meeting (STM).  We are using our authority as petitioners who called the STM to present only motions that reflect what the Select Board Water Tank Working Group defined as its strategy, not what we or anyone else thinks might be better. We believe those elected to make these decisions for the town, and to manage the implementation of those decisions, are the ones who are best positioned to guide the town through this project.\n\nI apologize for probably confusing everyone. Did my best. Please email me at alanday@engageweston.com with your questions, I’ll try to answer them as well as I can.\n","slug":"2025-03-02-funding"},{"frontmatter":{"title":"Summary of Siting Process for Proposed Cat Rock Water Tank, June 2023-Feb 2024","description":"Summary of Siting Process for Proposed Cat Rock Water Tank, June 2023-Feb 2024","date":"2025-03-04T00:00:00.000Z","categories":["emails"],"tags":["Water Tanks"],"authors":[""],"draft":false},"content":"##### This article was contributed by Lauri Bent.\n\n<center><strong>Memo</strong></center>\n\n<strong>To:</strong> Weston Select Board, Weston Town Manager Leon A. Gaumond Jr., Weston DPW  \n<strong>From:</strong> Laurie Bent, Select Board Member  \n<strong>Date:</strong> January 29, 2025  \n<strong>Re:</strong> Summary of Siting Process for Proposed Cat Rock Water Tank, June 2023-Feb 2024  \n\nAs a participant in the Select Board’s 10-month process of determining sites for new water tanks\nin Weston, I offer this summary of the siting process for the proposed Cat Rock Water Tank. I\nfocused on Cat Rock because it was the most difficult site to pin down and it required the\nlengthiest process, including the consideration and analysis of three potential tank sites that\nwere proposed by an abutter. I have included documents and presentations drafted by Wright-\nPierce, engineers, as well as summaries and minutes of site walks, Select Board discussions,\nand other relevant documents. I have included links to documents, meeting minutes, and\nmeeting videos that are available on the Town website. I hope that this summary of the process\nwill demonstrate the care and deliberation with which the Select Board approached this difficult\nand controversial decision.\n\n---\n\n### June 7 2023-Site Walk at Cat Rock\n\nAbutters received hand-delivered letters in advance of the site walk notifying them of the site\nwalk. Attendees included Select Board Members Laurie Bent, Christopher Houston and Thomas\nPalmer. Also attending were Wright-Pierce (W-P) Engineering Firm (Rob Williamson, Amy\nCoppers, and Liz Doerfler), Town Manager, Head of DPW, Representatives of Conservation\nCommission, Tree Advisory Group, Planning Board, and Town Engineer. A total of 32 people\nwere in attendance.\n\nIn advance of the site walk, W-P prepared a preliminary site plan showing one site, Site #1.\n\n![CatRockImage01](./images/CatRock01.png)\n\nMinutes of the Site Walk can be found here: [June 7 2023 Summary from Cat Rock site walk](https://www.westonma.gov/DocumentCenter/View/37101/Water-Tank-Site-Visit-Meeting-Minutes-Summary_Cat-Rock_PDF?bidId=)\n\nAs a result of the discussion with neighbors at the site walk, including Mr. Michael Chasan, W-P added an Alternative Site #2, which Mr. Chasan had proposed, to the preliminary siting plan. The revised preliminary siting plan also included an area at the top of Cat Rock, the look-out, which those present at the site walk unanimously agreed should be protected.   [W-P Preliminary Site Plan for Cat Rock](https://www.westonma.gov/DocumentCenter/View/36194/Cat-Rock-Preliminary-Water-Tank-Site-Visit-Plan-PDF?bidId=), reflecting both of these proposals, was developed in June.\n\n![CatRockImage02](./images/CatRock02.png)\n### Summer-Fall 2003\n\nDuring the summer and fall of 2023, Wright-Pierce prepared a Tank Siting Alternatives Analysis, as required by the Massachusetts Environmental Policy Act (MEPA) process.  The alternatives analysis for tank siting reflected concerns and issues expressed by attendees at the site walks as well as the practical considerations identified by the engineers and Weston DPW in siting the water tanks. The analysis was developed in consultation with volunteers and staff working on the Water Tank project (Laurie Bent, Leon Gaumond, Tom Cullen, and other members of DPW staff), and with the advice of the Conservation Commission.\n\n### November 27, 2023 Publication of Alternatives Analysis\n\nThe alternatives analysis was a methodology that was developed in recognition of the need to systematically balance the interests, sometimes conflicting, that had to be evaluated in siting each tank.  Those interests were sorted into 4 categories: impacts to preserved land, impacts to abutters, engineering challenges, and cost.  Each of these categories was further divided into the criteria that had been identified, as follows:\n\n<strong>Impacts to Preserved Article 97 Land</strong>\n- Area of Article 97 land change-in-use\n- Proximity to significant landscape features \n- Extent of tree clearing\n- Impacts to contiguous open space affecting wildlife and hikers\n\n<strong>Impacts to Abutters</strong>\n- Requires acquisition of private property\n- Proximity to closest house\n\n<strong>Engineering Challenges</strong>\n- Site access \n- Potential ledge removal\n- Cut and fill site work\n- Tank height\n- Impacts to infrastructure\n- Constructability\n\n<strong>Cost</strong>\n- Professional opinion of Probable Construction Cost\n\nEach criterion was given a maximum score that reflected a consensus of the relative importance of that criterion.  The total maximum scores added up to 100.  Scores were assigned as follows:\n\n| Criterion | Maximum Score |\n| --------- | ------------- |\n| Area of Article 97 Land change-in-use | 18 |\n| Requires Acquisition of private property | 12 |\n| Constructability | 12 |\n| Proximity to closest house | 10 |\n| Tree clearing | 8 |\n| Potential ledge removal | 8 |\n| Cut and fill site work | 8 |\n| Proximity to significant landscape features | 6 |\n| Impacts to contiguous open space for wildlife & hikers | 6 |\n| Opinion of probably construction cost | 6 |\n| Site accessibility | 4 |\n| Tank height from ground level | 1 |\n| Impacts to infrastructure | 1 |\n\nAn initial score from 1 to 3 was assigned to each of the 13 criteria for each alternative site based on how well that alternative site met the criterion.  That initial score was then multiplied by the maximum score assigned to each criterion for a final score.  Each site’s final scores were added together for the total score.  Accordingly, each site could be assigned a maximum possible total score of 100 (all criteria received a 3), a minimum possible total score of 33 (all criteria received a 1), or any number in between. \n\nA detailed summary of the process and the analysis was published on the Town website on November 27, 2023, and can be found here: [W-P Nov. 27, 2023 Final Tank Siting Alternatives Analysis](https://www.westonma.gov/DocumentCenter/View/36874/Updated-November-27-2023-Final-Tank-Site-Alternatives-Analysis-Report-PDF?bidId=)\n\nThe Cat Rock Alternatives Analysis results were as follows:\n\n|Category|Alternative Site 1|Alternative Site 2|\n|--------|------------------|------------------|\n|Impacts to preserved land (out of 38)|12.7|22.7|\n|Impacts to abutters (out of 22)|15.3|10.7|\n|Engineering evaluation (out of 34)|29.3|11.7|\n|Cost (out of 6)|6.0|2.0|\n|Total score (out of 100)|63.3|47.0|\n|Overall rank|1|2|\n\nAlternative Site # 2 would require the acquisition of property currently owned by Mr. Chasan.  The Alternatives Analysis prepared by W-P ranked Cat Rock Alternative Site #1 at 63.3, and Alternative Site #2 at 47.\n\n#### Sensitivity Analysis\n\nWright-Pierce and Town representatives also wanted to learn how robust the ranking results were.  How sensitive were the results to the weighting scores that had been assigned?  To evaluate that concern, different weights were assigned to each category to determine the effect of the assigned weights on the outcome.  The results were as follows.\n\n|Adjusted Criterion Weighting|Highest Scoring Alternative|\n| --- | ---- |\n|50% of total weight applied to “Impacts to Abutters”|Alt. #1|\n|50% of total weight applied to “Impacts to Perservced Land”|Alt. #1|\n|50% of total weight applied to “Engineering Evaluation”|Alt. #1|\n|Equal weighting for Abutters, Preserved Land, & Engineering|Alt. #1|\n\nThe conclusion regarding the Cat Rock siting analysis was that Alternative Site # 1 offered the only semi-flat area best suited for construction, requiring significantly less site work than Alternative Site # 2.  It did not require the acquisition of private property.  It allowed for easier access to the existing tank for demolition, and was the most cost-effective. The result was robust because the outcome held up even with significant changes in criteria weighting.\n\n### December 5, 2023 Select Board Meeting\n\nAt the December 5, 2023 Select Board meeting, representatives of Wright-Pierce presented and explained the alternatives analysis that had been developed in collaboration with Town representatives.  In preparation for the meeting, W-P created a summary siting analysis for all three proposed tanks, including Cat Rock, for presentation to the Select Board.  That summary analysis is available here: [W-P Dec. 5 2023 Summary of Alternatives Analysis](https://www.westonma.gov/DocumentCenter/View/36922/Water-Tanks-Siting-Alternatives-PDF)\n\nThe alternatives analysis process was explained, and the alternatives for each tank site were reviewed.  During the conversation, representatives of Wright-Pierce explained that tank sites had been adjusted in response to the input expressed at site walks as well as input communicated to the Town through the Town Manager.  As a result of community input, two proposed tank sites had been adjusted.  The Paines Hill proposed tank location had been shifted further east within the proposed land taking, and the Doublet Hill tank site had been adjusted to the east.  Both changes were made to minimize impact to abutters while accommodating engineering constraints.  The Select Board discussion can be viewed starting at 0:46 of the meeting recording, which is available here: [December 5 2023 Weston Select Board meeting](https://cloud.castus.tv/vod/weston/video/657073c9128b8e0008de66ab?page=HOME).  No vote was taken at that meeting.\n\n### January 5, 2024 Cat Rock Site Walk\n\nAfter the December 5 Select Board meeting, Mr. Chasan communicated serious concerns about the Cat Rock siting process to the Town Manager.  As a result of his concerns, an additional Cat Rock site walk was conducted on January 5, 2024. \n\nMr. Chasan indicated at the January 5th site walk that he no longer favored Alternative Site #2, and that he would prefer a site location further up the crest towards the peak of Cat Rock.   Based on Mr. Chasan’s request, Wright Pierce did a further analysis of a proposed new location for the water tanks at Alternative Site # 3.\n\nMinutes from that meeting are here:[Jan 5 2024 Cat Rock Site visit minutes](https://www.westonma.gov/AgendaCenter/ViewFile/Minutes/_01052024-7549)\n\n### January 23, 2024 Select Board Meeting\n\nAt the Select Board Meeting of January 23, 2024, all three proposed tank sites (Paines Hill, Doublet Hill, and Cat Rock) were discussed.  The final tank site locations were voted on for Paines Hill and Doublet Hill.  As a result of concerns expressed by Mr. Chasan about the Cat Rock site, that decision was postponed so that more information could be gathered.  Minutes from the January 23, 2024 Select Board meeting can be found here: Minutes of [Jan 23 2024 Select Board Meeting](https://www.westonma.gov/AgendaCenter/ViewFile/Minutes/_01232024-7585)\n\n![CatRock03](./images/CatRock03.png)\n\nAlternative Site # 3, proposed by Mr. Chasan at the January 23, 2024 Select Board meeting, is shown above.  It would require leveling a portion of the top of Cat Rock, as well as land takings from neighbors at 44 and 52 Whitney Tavern Road.\n\nThe portion of the January 23, 2024 Select Board minutes relating to Cat Rock are included below.\n\n> <strong>Cat Rock</strong>\n>\n> Cat Rock was acknowledged as the most challenging site. Wright-Pierce reviewed their recommended Alternative 1 and a new Alternative 3 proposed by the owner of 111 Bradford Road to locate the tank next to the existing one. The Wright-Pierce engineers explained that Alternative 3 would still require an Article 97 land transfer, likely need zoning variances, significantly impact Cat Rock outlook (despite the abutting landowner's assertions to the contrary), require extensive tree clearing, and cost $1-1.5 million more to construct due to site constraints and complex logistics. The owner's attorney and engineer disputed many of these points. \n>\n> Many residents spoke in opposition to Alternative 3, arguing it would destroy the iconic Cat Rock outlook. A couple of residents questioned why the literal top of Cat Rock was ruled out without detailed scoring. Ms. Bent reiterated that was a non-starter due to overwhelming public opposition to impacting that landmark. \n>\n>Facing the potential of Alternative 1 moving forward, the owner's attorney asked the Board to reconsider Alternative 2, which would put the tank on the owner's land, stating the owner would now be open to discussing that option which is preferable to him over Alternative 1. The scoring of Alternative 2 was debated.\n>\n> After extensive discussion, Ms. Bent suggested tabling a vote on Cat Rock for 2 weeks to allow Wright-Pierce to more thoroughly analyze Alternative 2, reach out to any other impacted abutters, and have the owner clarify what land arrangements might make Alternative 2 viable as a compromise between Alternative 1 and Alternative 3. The other members agreed to this approach and a special meeting will be scheduled in two weeks on Cat Rock.\n>\n> <strong>MOTION</strong>: \n>\n> No Motion as Select Board agreed to table the item for two weeks.\n\n### January 30, 2024  Mr. Chasan’s Representatives Present New Tank Siting Alternative\n\nIn light of strong public opposition to Alternative 3 expressed at the January 23rd Select Board meeting, representatives of Mr. Chasan presented another different alternative, labeled “Alternative Site # 2A” to the Town Manager, who referred it to Wright-Pierce for analysis using the Alternatives Analysis tool previously presented to the Select Board.  Alternative Site # 2A was similar to Alternative 2 (previously proposed by Mr. Chasan and analyzed in the November 27, 2023 Alternatives Analysis discussed above) but shifted the site to the southwest, closer to the existing water tank.  Alternative Site # 2A, like Alternative Site # 2, would require the acquisition of land from Mr. Chasan.  \n\n### February 1, 2024 Town Manager Communication to Select Board\n\n*Letter to the Select Board from the Town Manager regarding a January 31, 2024 meeting with Laurie Bent, Mr. Chasan, his attorney, Dan Hill, and his engineer, Sean Reardon.  Note that to avoid confusion, the “Alternative Site # 2” site referred to in this letter is labeled “Alternative Site # 2A” in the W-P Feb 2024 Alternatives Analysis, since this new siting proposal is shifted significantly to the southwest from the original “Alternative Site # 2” proposed by Mr. Chasan and analyzed in the W-P Nov 2023 Alternatives Analysis.*\n\nRE: Weston / Water Tank Replacement  \nFrom: Gaumond, Leon  \nTo: Bent, Laurie; Houston, Christopher; Kelley, Susan; Palmer, Tom; Yanakakis, Lisa  \nDate: Feb. 1, 2024  \n12:56 pm  \n\nAll,\n\nI wanted to follow up with everyone about the conversation we had with Mr. Chasen, his attorney and his architect about the Alternative 2 site at Cat Rock.  For reference you can see the long report that was sent to us in advance of the meeting yesterday.\n\nLet me jump to the conclusion – Mr. Chasen is not willing to donate the land for the Alt. 2 site.  However they are making the case that Alt. 2 would be visually more appealing in the neighborhood than Alt 1 especially when standing at the top of the hill facing down the ski slope and from a cost perspective, they are contesting the additional cost estimates from W-P.\n\nI explained that the Town envisions that Alt. 2 would cost roughly $600,000 more than Alt. 1.  Concerning cost, they claim the following:\n\n1. They feel Alt 1 has significant more stormwater impacts which will need to find a new solution for.  Readon feels that Alt. 1 will cost nearly $100,000 more expensive than Alt. 2 to address these issues.\n2. They feel Alt. 2 benefits from having greater access to the current tank location for a laydown area.  They feel less trees would need to be removed in Alt. 2 because the contractors would be able to utilize the already clear area around the current tank to store equipment & materials that would not be easily utilized with Alt. 1.  Less trees removed equals lower cost and better for the site and abuters.\n3. They are contesting the ledge & fill additional costs that W-P claims would be necessary. Their consultant both Alt 1 and Alt 2 would require 24 cubic tons of fill which they believe to be about $10-$15 per cubic yard.  Also that Alt. 2 grading will be same as Alt 1.\n4. They maintain that the constructability score is incorrect.  Reardon claims the scores should be more equal and not necessarily as lopsided as they are presented by W-P.\n5. Most intriguing, they are questioning the need to discontinue the existing 10” water main from cat rock to Overlook.  They maintain that keeping that easement instead of creating a new water main from Alt. 1 down Bradford makes significantly more economically sense and feels that the design adds roughly $1-$2 million in unnecessary costs. Unfortunately I couldn’t remember if we were 100% committed to abandoning the current 10” water main so that would need to be confirmed.\n6. They also feel that Alt 2 Article 97 impact could be done as a license not a taking, so better for the MEPA process.  Neither laurie or I were sure about this.\n\nBecause of their disagreement on the costs, they feel Alt 2 is more cost effective and provides for a better solution for the ultimate appearance of the area. As such, they are not interested in ‘donating’ the land to the town for this site.  Initially they were talking about a ‘land swap’ where we could use the land we need and Chasen would get an equitable portion of the current tank site which connects to his property adjacent to 22 overlook in the wester portion of the current tank site.  Laurie & I made it clear that we are seeking to retain this site for a future tank site location 100 years from now.  We explored an idea about having that land swap revert back to the current layout when the next tank is to be cited in the future.  Not sure how easy that it to accomplish but its an idea!\n\nWe met for 45 minutes and I would say the conversation was generally cordial but they did make the point TWICE that if Alt. 1 is chosen they intend to make the MEPA process difficult for the town by inserting this as a most viable alternative.  We told them that we sort of expected that.  We also pointed out that putting the tank in the Alt. 2 location would indeed be an improvement for Chasen but would be more challenging for people at Overlook & Spruce Hill.\n\nI would ask W-P to review the discussion points above for a future discussion with the Select Board. Laurie & I also feel we should do a full matrix review of alt 2, conceding whatever points may be valid and contesting others.  It's important that we do a consistent analysis in comparing the two sites.\n\nFor the Select Board, we ought to schedule a meeting to finalize this site location.  Your next scheduled meeting is 2-13 (roughly 2 weeks from now).  Is there any interest in scheduling a BoS meeting next week (2-7 for example) during the daytime to consider this or do we wish to defer until the 13th?  W-P should probably be asked when they feel they could be ready for a discussion on this.  Amy & Rob?\n\nLeon\n\n### February 27, 2024 Select Board Meeting\n\nThe Select Board took up the Cat Rock siting decision again at its February 27, 2024 meeting.  Wright-Pierce presented its analysis of Mr. Chasan’s proposed site labeled “Alternative Site # 2A.”\n\nW-P drafted a siting plan showing the three alternatives (Alt. Site #1, Alt. Site #2, and Alt. Site #2A) under consideration.  Alternative Site #3 was no longer under consideration.\n\n![CatRockImage04](./images/CatRock04.png)\n\nThe W-P Alternatives Analysis for Site 2A can be found at this link: [February 27, 2024 Cat Rock Alternatives Analysis](https://www.westonma.gov/DocumentCenter/View/37586/Feb-2024-Water-Tank-Storage-Discussions-PDF?bidId=)\n\nIn the discussion before the Select Board, Wright-Pierce noted that Cat Rock was a more challenging site than either Doublet Hill or Paines Hill.  A careful comparison of Alternative Site # 1 and Alternative Site # 2A indicated that a tank at Alternative Site # 2A would be more challenging and riskier to construct than Alternative Site # 1 due to its close proximity to the existing tank and to critical water main infrastructure.  The steepness of the Alternative Site # 2A would require more earth work.  The 1:1 slope that the proponent suggested was not recommended by Wright-Pierce, who stated that a 2:1 slope would be more stable.  Wright-Pierce engineers stated that the proponent had not adequately accounted for stormwater drainage.  Due to the additional risk to the existing tank and infrastructure, the cost of Alternative Site # 2A would be $200K to $600K higher, and would require a longer construction duration.  The final score of Alternative Site # 1 was 66 and of Alternative Site # 2A was 61.7.  After a presentation and discussion lasting almost two hours, the Select Board voted to approve Alternative Site # 1 as the site for the Cat Rock water tank.\n\nThe minutes are available here. [Feb 27 2024 mtg Select Board minutes](https://www.westonma.gov/AgendaCenter/ViewFile/Minutes/_02272024-7643)\n\nThe portion of the minutes pertaining to the Cat Rock siting discussion are reproduced below.\n\n><strong>Discussion on Cat Rock Water Tank Site (PP#01)</strong>\n>\n>The Select Board addressed the siting of a new water tank at Cat Rock. Consultant Wright-Pierce had previously recommended \"Alternative 1.\" Subsequently, an abutter hired experts who proposed a new \"Alternative 2A\" site and provided their analysis using the same matrix as Wright-Pierce. \n>\n>Amy Coppers from Wright-Pierce presented their W-P’s evaluation of Alternative 2A, independent of the analysis of Alternative 2A provided by the abutter’s engineer and lawyer. Wright-Pierce’s analysis scored Alternative 2A lower than Alternative 1 under the tank siting matrix analysis. Key factors affecting the score included more disturbance of conservation land, greater site challenges, greater construction risks, and higher costs. The W-P score was lower on these factors than the score provided by the abutter’s engineer.\n>\n>The abutter, Michael Chasan, shared renderings showing the visual impact of the tank at Alternative 1. He argued it would ruin the scenic view from the Cat Rock summit and urged reconsideration of Alternative 2A to preserve the cherished spot.\n>\n>Amy Coppers showed some renderings of the tank at Alternative 1 that showed smaller visual impacts than were shown in the renderings shared by Mr. Chasan.\n>\n>Dan Hill, attorney for the abutter, questioned some of Wright-Pierce's scoring and suggested that Alternative 2A's visual impact could be mitigated by plantings. He contended that the four-point difference in score between Alternative 1 and Alternative 2A did not justify the aesthetic harm of Alternative 1. Sean Reardon, engineer working for Mr. Chasen, questioned Wright-Pierce’s evaluation of the site challenges of Alternative 1 versus Alternative 2A.\n>\n>Other residents shared concerns about impacts to views, trails, property values, drainage, and the process which they perceived to be rushed. Some urged slowing down and separating the Cat Rock tank decision from two other tank projects. \n>\n>The Select Board acknowledged the difficult trade-offs and lack of any solution that would satisfy all abutters and residents. The Board expressed the belief that the process has been thorough. The Board has made every effort to consider the additional alternative (Alternative 2A) recently put forward by an abutter. However, the Board felt that Alternative 1 best met the overall needs of the town for this essential water project. The Board concurred with Wright-Pierce's objective analysis and recommendations and did not see any value in further delaying the choice.\n>\n><strong>MOTION</strong>:Mr. Houston moved to accept Wright-Pierce’s report and designate Alternative 1 as the site for the Cat Rock Tank. 2nd by Mr. Palmer.\n>\n><strong>Roll call vote</strong>: Mr. Houston, Mr. Palmer, and Ms. Bent voted in the affirmative. <strong>Approved unanimously.</strong>\n\nThe video of the Select Board meeting can be viewed at [February 27, 2024 Select Board Meeting](https://cloud.castus.tv/vod/weston/video/65dfb534ced0570008e263e5?page=HOME).  The Cat Rock Water Tank discussion begins at 1:13:00 and continues to 3:04:00. \n","slug":"2025-03-04-cat-rock-siting"},{"frontmatter":{"title":"Planning Board Tightens Up Water Tank Bylaw Proposal","description":"Planning Board Tightens Up Water Tank Bylaw Proposal","date":"2025-03-04T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"### Specific Addresses Added and Limits Antennas To Prohibit Cell Phone Antennas\n\nAt its February 26th meeting the Planning Board presented an amended water tank bylaw that addresses several key concerns voiced by residents. Some were concerned the bylaw might allow structures to be build to that height in other parts of town. The amended bylaw proposal specifies it applies to municipal water tanks at 3 specific addresses, so no other sites or private uses besides municipal water tanks are allowed by the bylaw change being proposed.\nThe Planning Board also responded to concerns by those claiming the bylaw would allow cell towers to be placed on top of the tanks by being clearer that only town antennas for fire, police or to communicate with the tank itself to monitor tank functioning are allowed on the new water tanks.\n\nThe draft amended bylaw proposal is at: [https://www.westonma.gov/DocumentCenter/View/39742/Amended-Water-Tank-Heights](https://www.westonma.gov/DocumentCenter/View/39742/Amended-Water-Tank-Heights)\n\nThe Planning Board will be meeting again Wednesday night March 5 to approve the amended bylaw. The meeting will be on Zoom at 6:30 at: https://us02web.zoom.us/j/86073094497. [UPDATE: A recording of the meeting can be found here:[\nhttps://imd0mxanj2.execute-api.us-west-2.amazonaws.com/ssr/watch/67ca07440ed66100086e05de]( https://imd0mxanj2.execute-api.us-west-2.amazonaws.com/ssr/watch/67ca07440ed66100086e05de)\n\nAs background, the zoning bylaw proposal is mainly in response to the preliminary water tank design which indicated that in order to meet the current town’s needs for water pressure for low pressure areas of town, and for adequate firefighting volumes of water during very dry summer periods, the tanks needed to be 40 ft higher than current zoning laws allowed, specifically 410 ft above sea level. When the tanks were built, many decades ago, the town was much less populated, had fewer if any estates that used town drinking water for landscape irrigation, and had fewer golf courses using town water for watering their grounds.  \n\nAs background, the zoning bylaw proposal is mainly in response to the preliminary water tank design which indicated that in order to meet the current town’s needs for water pressure for low pressure areas of town, and for adequate firefighting volumes of water during very dry summer periods, the tanks needed to be 40 ft higher than current zoning laws allowed, specifically 410 ft above sea level. When the tanks were built, many decades ago, the town was much less populated, had fewer if any estates that used town drinking water for landscape irrigation, and had fewer golf courses using town water for watering their grounds.  \n\n\n","slug":"2025-03-04-planning-board"},{"frontmatter":{"title":"Frequent Question About Pumps vs Tanks","description":"Frequent Question About Pumps vs Tanks","date":"2025-03-04T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"We get a frequent question about the tank project questioning if replacing the tanks is better than using pumps spread around the town, or some other pump design. We're not engineers, or experts in the details found during the 4 year course of the project, so we went looking in the water tank project website and found this explanation in their Frequently Asked Questions section of the website. There is a ton of information about the project at their project website at:\n\n[https://www.westonma.gov/1828/Water-Tank-Replacement-Project](https://www.westonma.gov/1828/Water-Tank-Replacement-Project)\n\nThere are links to the video recordings of all the Select Board Water Tank Working Group meetings if you are a glutton for punishment, or if you think you might vote against the project. At least know the details of the project and respect the very hard work of all the Select Board members and learn about their deliberations before you vote.\n\nAll 3 Select Board members worked extremely hard above and beyond their normal heavy work loads to dig into the project elements in an admirably collaborative and productive way. Especially in last week's meeting they went through every possible issue that has been brought up and discussed each topic and indicated where they stood on each issue.\n\nFAQ sites can be found both on the front page of the project site at:\n\n[https://www.westonma.gov/Faq.aspx?TID=57](https://www.westonma.gov/Faq.aspx?TID=57)\n\nThis their description of the pumps vs tanks question. taken from the town's water tank project website.\n\n---\n#### Can Weston Fix its Water System with Pumps?\n\nA question that has come up with some regularity over the years that the Town has been discussing Weston’s water insufficiency is whether the problem can be solved with pumps rather than by raising the height of the water tanks. In some ways, it would be an appealing solution. While we would still need to build new tanks, since the old ones have reached the end of their useful lives, we wouldn’t have to build tanks that are proposed to be 40 feet taller than our current tanks. (Because the old tanks need to remain in service while the news ones are being built, the issues of finding sites for those tanks, and the need for a land swap, don’t go away.) Pumps are not the answer. They are more expensive and less reliable. Furthermore, they would not meet state requirements for fire safety. Website link:\n\n[https://www.westonma.gov/Faq.aspx?TID=57](https://www.westonma.gov/Faq.aspx?TID=57)\n\nFrom Jan 2023 FAQ’s, located by scrolling to the very bottom of the westonwatertanks.com page.\n\nFAQ # 5. Can we solve our water provision issues using more pumps or using the pumps we have more continuously?\n\nWe cannot solve our water issue by relying on pumps. It is true that in very small water systems consisting exclusively of residential customers, pumps can be sized to provide peak-hour demand and firefighting volume. In fact, that is exactly how our small Black Oak pump station is designed to work. But this station only serves a very small population. In large systems, meeting peak-hour demand 1 and firefighting volume would require prohibitively large and expensive pumps.\n\nUnder standard water engineering practice, pumps are designed to meet the maximum-day demand, 2 and tank water storage is designed to supply the peak-hour demand above the capacity of the pumps. To instead design a system that relies on pumps to meet the peak-hour demand would be complex, requiring more pumps to supply a greater range of flows. Not only would we need more pumps, but the pumps would need to be more powerful. Furthermore, system piping would need to be significantly upsized, all of the electrical systems in the pump station would need to be increased, the capacity of the emergency generator woul need to be increased, and the control systems for the additional pumps would need to be upgraded. Using pumps rather than tank storage to meet peak-hour demand would be more complicated and less reliable than using water tanks with adequate storage capacity.\n\nFurthermore, the Insurance Services Office, which sets the Town’s insurance rates, does not consider reliance on pumps alone to be a suitable or reliable provider of water for large fire flows. The State also requires that water needed for firefighting come from water storage. Engineering practice and state guidance both dictate that pumps be designed to meet only the maximum-day demand. Water demands that are higher than that, such as peak-hour demand, should come from water storage. Our pumps were designed so that one pump meets average- day demand, and two pumps meet maximum-day demands. The third pump is a backup pump.\n\n1. Peak-hour demand is the maximum demand that occurs over a one-hour period. Peak-hour demand is the maximum volume that must be provided by all sources in the system (water supply and storage).\n\n2. Maximum-day demand is the maximum day of water use that occurs in a given year.\n\nBesides being the economical way to provide water pressure, storage from a water tank of adequate size and elevation harnesses the power of gravity, which is much more reliable than electric pumps. Gravity works even when the power goes out. That is why tanks of adequate size and height are the standard, tried and true approach to the provision of municipal water. As climate change increases our need for resilient systems in the face of ever-fiercer storms, a water system based on the power of gravity rather than the electrical grid is by far the wiser approach.\n\n(Average day demand is defined as the total water use in a year divided by 365 days)\n\n---\nHope this information is helpful to you.  \nSincerely,  \nAlan Day\n","slug":"2025-03-04-pumps-vs-tanks"},{"frontmatter":{"title":"Lisa Reitano, FinCom member's analysis of the Water Tank Replacement Issue","description":"Lisa Reitano, FinCom member's analysis of the Water Tank Replacement Issue","date":"2025-03-07T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"Very informative letter from Lisa Reitano, member of the Weston Finance Committee. It is a very important read for anyone considering voting at the Special Town Meeting on Wednesday March 12 and is among the most complete and direct explanation of the situation Weston finds itself regarding our water system, and our options for improving it.\n\nPlease Read it.  \nAlan Day\n\n---\nI am a member of Weston’s Finance Committee, but I am not speaking for the committee as we have not discussed my article below, which began as a response to some questions that a resident sent to me. I will note that FinCom voted unanimously to support this project both prior to the December Town Meeting and again for the March 12 Town Meeting. I would like to address some financial issues concerning the water tank replacement project.\n\n#### Why are We Doing This Project at All?\n\nThe main reason to do this project ASAP is that we are at risk for not having enough water to fight a fire if it occurs during a high use time. For example, this could occur during a drought where people are using a lot of water for both domestic purposes and their lawns so the tanks won’t have enough water to fight a fire. The entire town is subject to this fire risk. The plan to drive around town and tell heavy users to shut off their irrigation systems if water tank levels get too low is not a good risk management strategy.\n\nThis occurred in 2016, when tank levels were very low and we would not have had enough water to fight a fire if one broke out. We lucked out in 2016, we may not luck out next time. Our water tanks are also old and need to be replaced before we have structural problems.\n\n#### Why the Rush to do This Project Now?\n\nI agree that a project of this magnitude should not be rushed. I know that it feels like it is being rushed to some who have started to follow it more recently than those of us who have been involved for the past few years.\n\nHowever, various alternatives have been considered, including different heights and sites, adding pumps and pumping stations and more tanks, etc. There have been forums on all aspects of the tanks, the FinCom has had presentations on the project at our meetings, and it has been discussed at many Select Board meetings over several years.\n\nThere were also numerous site walks with abutters. When one abutter hired his own engineer to come up with alternatives, those alternative sites were carefully reviewed and considered by the working group and our consultants and were the subject of Select Board meetings as well. I should also mention that Wright Pierce, our consultant, has built around 90 water tanks in various towns and they are engineers. I wish there was an answer to “heights and sites” that would make everyone happy, but it is not for lack of trying.\n\nI have been asked if we should wait to vote on this project until Annual Town Meeting in May rather than have a March Town Meeting vote, and if we should consider constructing all three tanks at once or one at a time.  Legally we have to hold a Town Meeting in March to vote on this, as enough citizens signed the petition to force one to be held, so we will be voting on it.\n\n#### Financial Reasons to do all Three Tanks Now\n\nThe water tank project involves replacing our three water tanks in town at a cost of $43 million. This cost includes larger tanks to handle current water needs as well as those needs arising from population growth resulting from mandatory 40(B) and MBTA 3A projects.\n\n- If we don’t vote to do the project, we will need to spend $4-$5 million for some repairs to the tanks because the state will demand that we do that as our tanks are old and deteriorating.  That’s a waste of money if we are going  to replace the tanks, but the state isn’t going to continue to let us slide if we don’t go ahead. Nor do these repairs solve our water storage problems.\n\n- There are economies of scale with doing all three together.  We would expect that someone who is bidding on the project would be able to do it for less than it would cost to do all three separately.  We don’t want to end up with different firms doing different tanks.  And we save time and resources by working with the state (MEPA) by doing conservation land swaps for all three tanks at once.  In fact, MEPA strongly recommends that all three be done together.  \nThe three tanks function as a single system requiring that they are built to the same elevation.  If we do them separately, we do not get the benefit of additional active storage until all three come online.  If one or two are constructed first, they can still be used but not to their design elevation or they will overflow the third tank.\n\n- We have debt reasons for wanting to do this sooner rather than later.  We currently have some town debt that is wearing off, but we need to add more debt for three big projects:  water tanks, fire station rehab/replacement, and a High School /Middle School rehab or replacement.  Actually the water tank replacement project may prove to be the least expensive of the three.  \nWe need to space out these projects or we will be overwhelmed with a lot of debt at one time and could jeopardize our town’s AAA rating.  So doing the water tanks soon, and doing all three together, will help us space out the debt as well as the debt service impact on our tax bills.  The fire station project is not ready to go yet, and the HS/MS project is even further down the road, but all three may involve some debt at the same time.  The more debt we have paid off towards the water tanks when we add the others, the better.\n\n- We hope to get a low interest rate loan from the state (2.4%) which is available for water tank replacement projects.  We may not get the loan, as there are limited funds available, but we have applied.  Typically we have construction bids in hand when we vote on a project at Town Meeting but that is not necessarily the process here because there are time stipulations with applying for this loan. If we qualify for the loan, we are required to submit fully engineered plans suitable for construction bids prior to the approval of the funds.  The process requires that we have fully appropriated the estimated costs of the project, as we pay the costs and the state reimburses us.  \nAlso a water tank contractor does not want to bid on a project that they don’t know is definitely going to happen (i.e. a project that we haven’t secured money for yet) as that limits their bonding capacity for taking on other projects.\n\n#### Do we need to vote on both design and construction funds now, or is it okay to delay the vote for construction funds to next year?\n\n- Again, we don’t want to pay $4-5 million to repair tanks that will soon be replaced.  We have been asking the state to allow us to avoid repairing our tanks as we are planning to replace them, and so far they have agreed.  We can make a better case to the state to avoid spending  money on repairs if we have actually allocated funds for both design and construction.\n\n- We may potentially get better bids from more water tank construction firms if we have fully committed to the project, i.e. voted the construction funds.  There is a more limited group of companies that do water tank construction than do general construction, and they have a limited ability to take on projects.\n\n- If we were able to get the low interest rate loan from the state for even a part of the project, we would need to have the construction funds approved prior to June 30 to qualify.\n\n- Many town construction projects, like buildings, have  lots of design options that require discussion and many choices to be made and perhaps revisited.  Water tanks not so much.  Once heights and sites are chosen, there is not a lot of variability in what needs to be decided.  The Planning Board will still have an influence to address landscaping, lighting, fencing, etc. around the tanks.   \nBut this lack of options makes it much easier to estimate the full costs of the project, and as Wright Pierce does many of these projects, they have made a reasonable conservative estimate of the cost including contingencies.  Funds are not borrowed until needed.  If the project ends up costing less than expected, the extra funds are not borrowed, and any excess is returned to the town as “free cash.” \n\nFurther information on all aspects of this project is available at the town website, \n\n[https://www.westonma.gov/1828/Water-Tank-Replacement-Project](https://www.westonma.gov/1828/Water-Tank-Replacement-Project)\n\nLisa V. Reitano\n","slug":"2025-03-07-lisa-reitano"},{"frontmatter":{"title":"Respected Engineer Responds to Focus on Weston","description":"Respected Engineer Responds to Focus on Weston","date":"2025-03-11T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"  \nThis is a letter from Judy Nitsch, a consulting civil engineer from Weston who asked us to forward her letter to our email list. We're glad to do so as she is a very well known and respected engineer and we have had many engineering questions arise without adequate response. I hope you find her comments useful.  \nAlan Day\n***\nI am writing my thoughts regarding some of the engineering issues related to the Town of Weston water tanks project for distribution by Engage Weston. I am a civil engineer, registered in Massachusetts, with almost 50 years of experience designing site development and infrastructure projects. I have lived in Weston for 18 years.\n\nFirst, I am pleased that so much work has been accomplished to advance the water tank project since the December 3, 2024, Town Meeting. The new Working Group has had important meetings to review questions and share feedback. I feel we are all more informed about this necessary project in our town.\n\nSecond, I want to respond to the engineering issues in the Focus on Weston handout at the December 3, 2024, town meeting, and their two subsequent emails dated 1/9/25 “Weston’s Water System” and 3/9/25 “Weston’s Water Future.”\n\nRegarding the handout at the last town meeting, I saw numerous engineering misstatements.\n\n1.  The very first sentence on Article 1 says ﻿”…no engineering drawings have been prepared…”:  \nI know from the work that has been presented that a lot of engineering drawings have been prepared. If they mean “construction documents” (“CDs”) they’d be correct, although one wouldn’t expect to have CDs at this point in the project design/permitting process.\n\n2. The first sentence continues with “…nor specifications and construction timetable necessary for an RFP…”:  \nSpecifications are never done at this point in a design project. They are normally done in conjunction with the CDs. Outline specs will be prepared first, but they wouldn’t be developed until the designs are further refined. Regarding the construction timetable, I’d seen information about that in the Zooms prior to that town meeting, but the town’s engineering consultant, Wright-Pierce, recently prepared this updated schedule: [Reports - Google Drive](https://drive.google.com/drive/folders/1yI1BBt67kpXP9-C5bjBMlFaIvvW3l6x2)\n\n3. The first sentence concludes with, “… nor have construction bids been sought.”  \nOf course construction bids haven’t been sought yet. The money for the project hasn’t been secured yet so the town can’t go out to bid yet. The purpose of Town Meeting Article 1 was to approve the anticipated expenditure.\n\n4. “The estimated $43 million cost covers only the tanks and related infrastructure and is less than half of the total estimated cost for all system upgrades that were recommended by Wright-Pierce in their 2019 Report.”  \nI’ve seen the components of the $43m estimate and know it includes more than what is noted in this statement. Additionally, I’ve read the 2019 report and agree that the $43m is less than half of the total estimated cost for all of the system upgrades that were recommended. (That total was $89.6M through 2040.) BUT not all of those components are being done as part of the water tank project and some are completed as annual projects, so that statement is untrue and misleading to the reader.\n\n5. The final two sentences of the “Vote NO: Article 1 - Appropriate for Water System Improvements” say, “…Specifically with respect to the tank replacement proposal, this complex project, and the land swaps that are required to execute the project, have not been sufficiently engineered, specified, and vetted for us to commit to the proposed expenditures. We recommend voting NO because we do not know what we are authorizing.”  \nIn my opinion, that is a misleading statement, and this project has been sufficiently engineered and vetted for this phase of the project development for the town to commit to the proposed expenditures. I know this because I’ve attended many of the site walks, zooms, and meetings on the project, and I am familiar with how large public infrastructure projects proceed through the design, funding, permitting, and construction phases.\n \n6. The Article 2 issue (amend Zoning Bylaws – Municipal Utility Structure Standards) was discussed in a water tank meeting zoom that I attended several months ago. The explanation made sense to me. The tanks need the antennae/appurtenances so the in-tank monitoring data can be conveyed to the Town DPW for observation/analysis. Voting to have the height limit adjusted in the zoning by-law to accommodate what we know is actually needed for the water tanks is appropriate . The statement, “… it can simply apply to the Zoning Board of Appeals (ZBA) for a variance or special permit…” is misleading. Going to the ZBA is anything but a simple process. Also, the ZBA decision can be appealed, thus derailing the project timing and increasing the project cost. Changing the bylaw to include the necessary building height for municipal structures is the way to help the project proceed expeditiously. I understand that some residents are afraid that this bylaw could be construed to mean any structure; the wording would be revised to limit it to municipal water tanks. This is my opinion as a civil engineer; I am not a land-use lawyer.\n\n7. Regarding their Article 3 paragraph – again as a civil engineer and not a land-use attorney – this is a chicken-and-egg issue. The design of the tanks has progressed enough so the areas needed for the new tanks can be ascertained. The Article 97 land swap process is time-consuming and must be completed prior to commencing construction. In order to meet the anticipated construction timetable outlined by Wright-Pierce, this work needs to commence now and run on parallel tracks to the project design. \n\nRegarding the 1/9/25 Focus on Weston email, I read several statements that I’d like to address.\n\n1. Second paragraph: The list of “incomplete” items included both design, engineering, schedule, and cost. Based on attending or watching the Water Tank Working Group’s meetings since then and my knowledge of how large infrastructure projects commence (per my comments above), I feel this is another misleading statement. However, I believe FOW no longer has these issues based on their 3/9/25 email and thanks to the good work of the Working Group in educating residents as to what the appropriate expectations are for this type of project at this point in its planning and design.\n\n2. Page 2, top paragraph: “Design should always precede funding.” Not necessarily. If a funding source is identified and the town might qualify for it, I believe we all should work together to be sure the town is positioned to receive such funds. That will reduce what the water users will pay in the long run.\n\n3. Page 2, Item 1.: “The estimated cost of $43 million may be very different when the detailed engineering and cost estimation gets done.” Completing detailed engineering plans is a part of this next phase of the project. But preparing cost estimates of the project is done at every stage of design, with appropriate contingencies to account for that phase of design.\n\n4. Page 2, Item 2. Siting and Permitting: “…siting is a pacing item for design, engineering, project documentation, for an RFP, and construction. This is a significant risk to the project schedule…”. The site analyses and discussions have progressed since this was published. Also, all projects have risks associated with land takings/swaps. To be an alarmist over the siting process isn’t productive.\n\nRegarding the 3/9/25 Focus on Weston email, I agree with much of what was written. There is a good summary of the actions taken since the first of the year. I agree with the recommendation to vote in favor of the first 3 items. Regarding the recommendation on the fourth vote, however, I would urge residents to vote yes. There is no harm in having this approval now and there is a risk in waiting for another town meeting to approve it. Additionally, I understand there is still the possibility of receiving some funds under the State Revolving Fund (SRF). If Wright Pierce could create an early utility package for the water main to the Cat Rock site, and if other towns ahead of Weston in the SRF queue aren’t “shovel ready” yet, we could be positioned to gain valuable funding for this initial phase of the project. It is worth considering. We will need to have voted to proceed with the construction, however, and voting no on the 4th question will prohibit that. I may suggest at Town Meeting that we consider approving an Early Site Package for utilities to the Cat Rock tank if Wright Pierce thinks this is a viable option and has an estimate for that work that could be voted on Wednesday.\n\nI look forward to seeing everyone at Town Meeting on Wednesday night.\n\nJudith Nitsch, PE, LEED AP\n","slug":"2025-03-11-judy-nitsch"},{"frontmatter":{"title":"Preview of the Water Tank Special Town Meeting Wednesday, March 12, 7:00 pm","description":"Preview of the Water Tank Special Town Meeting Wednesday, March 12, 7:00 pm","date":"2025-03-12T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"There will be three articles to be considered. Each has it’s supporters and detractors, though nearly all parties agree that all but the last article, authorization to borrow to construct the tanks, should be passed. From engageWeston’s perspective, the people most knowledgeable about Weston’s town finances support the borrowing article, and we agree. We urge voters to pass the construction financing now rather than delay the decision and continue to keep this project in limbo and at risk.\n\nA feature of the procedures regarding articles, and verbal motions to consider an article, allows modifications of the article within the motion. The Select Board, the Planning Board and the petitioners who requested this town meeting agreed to make modifications to articles within the motions to better reflect the suggestions raised by the public. We’ll explain those modifications below.\n\n#### Article 3, Motions 1 and 2 (Funding) (described out of order)\n\nTom Palmer, chair of the Select Board, and a long time member of the Finance Committee will be presenting the details of the financing motions at the town meeting. Article 3 in the warrant book regarding funding for the project will be split into two motions. Article 3, Motion 1 will authorize expenditures for finishing the design of the project and also hiring an Owners Project Manager, a consultant who can help the Select Board manage the project and provide the Select Board with expert review of the design consultants’ work.  \n\nThis change to split out the design and OPM funding is in response to resident comments and also separates issues requiring a majority vote from those requiring a 2/3 vote. This motion is proposed to be funded out of Free Cash the town has built up, so this motion will need only a majority vote to pass. The project stops without the passage of this motion since funding for engineering design consultants and project management would not be available without its passage, and we strongly urge its passage.\n\nArticle 3, Motion 2 authorizes construction funding and borrowing to fund it, with nearly all loan payments to be sourced from the Water Enterprise Fund populated with funds from the water rates both past and future, not real estate taxes. The Weston Finance Committee voted unanimously to support approval of this motion to authorize borrowing funds for the construction. The Chair of the Finance Committee will be presenting their thinking in support of all the motions at the Special Town Meeting. \n\nLisa Reitano, a long time member of the Finance Committee wrote a long letter reviewing all aspects of the various articles and urged passage of the construction financing for a number of important reasons. We will reprint her letter and have it available as a handout before town meeting. Tom Palmer, Chair of the Select Board will present the explanation of the construction motion at the town meeting and he has urged passage of the construction funding motion.\n\nThis will likely be the most discussed motion and we urge you to pay careful attention to the presentations and make your decision on your vote carefully. After our efforts to attend all the Select Board Water Tank Working Group’s sessions and the Finance Committee’s discussion of this funding issue, we believe the most knowledgeable people are correct and it’s in the town’s best interests to pass the construction funding now rather than wait until some uncertain future date. We believe the delay would also cause challenges with our ability to apply for state sponsored low interest water project loans, and to our ability to get construction bids from qualified tank builders since builders are very unlikely to spend in the range of $100,000 to put together a bid for a project with no approved funding.\n\n#### Sites and Heights Articles Preview\n#### Article 1\n\nThis involves approving the town’s efforts to request a conservation land swap. The existing sites are too small to build the replacement tanks without seriously jeopardizing the existing tanks during construction. Adjacent land is all conservation land.  The Town is proposing to put town land in the Case Estates area into conservation protection to swap with conservation and taken to build the new tanks. There really isn’t any other choice, as we understand the situation. The Conservation Commission worked with the Select Board in choosing the land to be swapped, so we are confident the swap proposed is the best option. The total land swapped for all tanks is around 5 acres.\n\nOne abutter to the Cat Rock proposed tank is objecting to that proposed site and will likely present his case during the meeting. While no one wishes discomfort on a neighbor, the documentation of the siting evaluation process clearly shows that all possible siting options were explored thoroughly and the one chosen on Cat Rock is the best one for the town as a whole both economically and functionally. We urge voters to approve the land swap article for the sites selected by the Select Board Water Tank Working Group.\n\n#### Article 2\n\nThe engineering consultants calculations indicate that the new tanks need to be 40 feet higher above sea level than the current ones in order to provide enough water pressure and water volume for the town’s current and future water needs and storage of emergency volumes of water for adequate firefighting in times of heavy water use as in dry summer periods. Current zoning bylaws do not allow structures of that height, 410 ft. above sea level. Consequently, a bylaw change is needed to build new tanks that meet our current and projected future water needs and assure sufficient water is available for firefighting. \n\nIn 2016 the tanks were essentially empty during an especially dry summer period and firefighting would have been severely hampered if we’d had a fire at that time. Our safety, and probably our home insurance rates, depend on us building these new tanks to the proposed heights.\n\nThe Planning Board listened carefully to resident concerns and proposed changes to the article written in the Warrant so limit the zoning bylaw changes to only the specific locations of the 3 new tanks and that prohibit antennas for private use like cell phone towers.\nWe strongly urge voters to approve the amended bylaw article which will be presented as amended in the motion to consider the article during the special town meeting proceedings.\n\nSincerely,  \nAlan Day\n","slug":"2025-03-11-town-meeting"},{"frontmatter":{"title":"Important Town Meeting Vote on March 12 — Water Tank Articles","description":"Important Town Meeting Vote on March 12 — Water Tank Articles","date":"2025-03-12T00:00:00.000Z","categories":["emails"],"authors":["Nancy Piedra"],"tags":["Water Tanks"],"draft":false},"content":"Dear Neighbors,\n\nTown Meeting is **Tuesday, March 12 at 7:00 PM** at Weston High School. There are only three articles on the warrant — this meeting will likely be **shorter than others**, but **your vote is critical**.\n\nBelow are recommendations from Engage Weston on how to vote on each article and why:\n\n**Vote YES on Article 1 – The Sites**  \nThe engineering firm, after extensive analysis and input from abutters, identified these sites as the best locations from both an engineering and financial perspective. (This requires a 2/3s vote.  Every vote counts!)\n\n**Vote YES on Article 2 – The Height**  \nThe zoning bylaw change will only apply to the proposed sites, and any antennas will be restricted to Town use only. (This requires a 2/3s vote.  Every vote counts!)\n\n**Vote YES on Article 3 – Motion 1 (Funding)**  \nAuthorizes $2M from Free Cash to continue the design process.  Majority vote.\n\n**Vote YES on Article 3 – Motion 2 (Funding)**  \nAuthorizes the remaining funds to complete the project ($2M from Free Cash and ~$37M in borrowing. This requires a 2/3s vote). Why now – and not later at a following meeting?\n- **Secures eligibility** for low-interest state loans for all or part of the cost.\n- **Authorizes borrowing if and when needed** — permission, not immediate debt.\n- **Shows commitment** to avoid $4–5M in state-mandated repairs to aging tanks.\n- **Strengthens contractor interest** — the best contractors will not bid unless the project is fully funded.\n- **Avoids repeated Town Meeting debates** — let's use our time and energy wisely and not go through this again!\n\nFor a one-page flyer summarizing the key issues, click here: https://drive.google.com/file/d/1mkSwhuBPR2drW-Zbdqq2wk_0L0X40Yvp/view?usp=sharing\n\nPlease plan to attend and make your voice heard!\n\nBest,  \nEngage Weston\n\n","slug":"2025-03-12-town-meeting-2"},{"frontmatter":{"title":"Thank You from Laurie Bent","description":"Thank You from Laurie Bent","date":"2025-03-16T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Water Tanks"],"draft":false},"content":"This is a letter from Laurie Bent in thanks to the many people who contributed to the success of the water tank project.  \nAlan Day\n***\nMarch 16, 2025\n\nTHANK YOU\n\nMy gratitude for the Special Town Meeting last week is deep and wide.\n\nThanks To: Alan Day. You led a group effort to ask the Town to hold a special Town Meeting devoted to water tanks. You put together a petition and organized a team of people who spent frigid winter weekends outside at gathering spots all over Weston—at the Transfer Station, in front of Heirloom--collecting signatures. I think you wound up with 400 signatures for the petition.\nThank you to all of the signature collectors and petition signers. It was a huge group effort, and\nyour persistence paid off: you achieved the Special Town Meeting. I don’t know if this has ever\nbeen done before in Weston. It was hard to do, and you did it.\n\nAlan Day, Alice Benson, Nancy Piedra, Tom Timko, Jeffrey Barz-Snell, John Hennessey, and Nancy Vescuso. You started up a newsletter, “engageWeston,” from scratch. You created a mailing list. You wrote articles summarizing meetings, you asked me and other people knowledgeable about the water tank process to write memos to explain aspects of water tanks that you wanted to understand better. You republished information from the Town website that may have been hard for casual observers to find. The engageWeston newsletter has earned credibility, in the short time of its existence, for its honest, fact-driven approach to local issues. It was hard to do, and you did it.\n\nWater Tanks Working Group I. Leon Gaumond (Town Manager), Tom Cullen (former DPW Director) Rob Williamson (of Wright-Pierce), and Amy Coppers (of Wright-Pierce). You attended dozens and dozens of meetings, forums, site walks, and Select Board meetings, Planning Board meetings, and Conservation Commission meetings. Rob and Amy, you explained the basics of hydraulic systems and water tank design over and over, to consecutive waves of questioners, volunteers and interested citizens, without ever growing visibly impatient. Leon, you were fully engaged in this effort since it commenced in 2021. Over four years, you never stopped thinking and strategizing to find the road to success. Tom Cullen, you were forthright and passionate and always brought us back to the basics regarding the primary importance of providing clean water to the Town. Despite the discouragement of coming short of votes at several Town Meetings, this group never lost its forward momentum. The stakes were too high, and everyone understood that.\n\nWater Tanks Working Group II. Tom Palmer, Lise Revers, and Rich Sullivan (Acting DPW Director) joined the working group and came up to speed. Tom, with the assistance of Finance Director Susan Kelly, you dug into the finances of the water tank project and explained the fiscal impact on the Water Enterprise Fund and the Town as a whole. You also managed lengthy, disputatious weekly meetings with grace, fortitude, and good will. You encouraged participation by the public and let everyone have their say, while still moving the process forward. The meetings were transparent and public, and everyone who wanted to learn more about water tanks had their opportunity to ask questions; those who wanted alternative proposals to be considered had their opportunity to offer suggestions.\n\nConservation Commission. Conservation Commissioners Rees Tulloss and Alison Barlowe, and Conservation Administrator Jordan McCarron. You worked diligently to identify municipal land parcels that would be good candidates for the land swap. The entire Commission met to discuss the land swap and work through complex logistics. Rees, you made a compelling and eloquent presentation on the land swap on Town Meeting floor.\n\nPlanning Board. Leslie Glynn, Chair, Shawn Lanier, Planning Board member, and Imai Aiu, Town Planner. You partnered with me to find a good solution to the height vs. elevation dilemma for a water tank bylaw. We worked together to find common ground on the role that Planning Board should take in ameliorating the impact of the water tanks on abutters and conservation land by agreeing to a Letter of Intent. I enjoyed working with you, and was grateful for the support and collaborative spirit you brought to the process of finding good compromises.\n\nFinance Committee. Bharath Venkataraman, Chair, and Lisa Reitano, Former Chair. You took an active role in pushing the project forward. You both spoke up effectively at several Town Meetings. Lisa wrote a piece for engageWeston that clearly explained the financial implications of delaying the water tank project. Members of the entire Finance Committee were stalwart supporters of the project since early 2023, when they encouraged Water Tank Working Group I to go for all three tanks as a package.\n\nJudy Nitsch, resident, engineer, and engaged citizen. Judy, from the first site walks, you offered to help abutters understand the process and the engineering of water tanks. Since then, you have generously shared your expertise whenever asked. You explained complex financing and engineering issues to lay people. You spoke as an authoritative but neutral voice at Town Meetings, and have been generous with your time.\n\nTown Manager’s Office, Schools, and Town Staff. Leon Gaumond, Lisa Yanakakis, and Steve Addonizio. You, in concert with Rip Hastings, Town Moderator, and Janet Murphy, Town Clerk, worked to put together a flawless Town Meeting on very short notice. High School Principal Bairstow, and the High School facilities staff, including Dr. Neil Trahan, in charge of Technology and Operations, and IT Director Tracy Sullivan and the Weston IT staff. You prepared the HS auditorium and made a last-minute, unexpected Special Town Meeting possible. You, and the many workers behind the scenes, made the complex process of setting up and running a Town Meeting look easy.\n\nWeston Owl and Kristin Barbieri. You were always willing to publicize events, provide analysis, and publish editorials in support of water tanks. You have become a Weston institution that will be dearly missed when you hang up your cleats.\n\nFriends, Neighbors, and fellow Westonians. You came together on Wednesday, March 12, 2025 and made all the difference in the world to me, approving the water tank project articles by an overwhelming 90%. I will be forever grateful for the support and goodwill I experienced that night. It is like nothing I have ever felt before, and I will never forget it.\n\nThank you all, from my heart.\n\nLaurie Bent  \nMember, Select Board\n","slug":"2025-03-16-laurie-bent"},{"frontmatter":{"title":"Town Governance Study Committee Hearing - Select Board 3-5","description":"Town Governance Study Committee Hearing - Select Board 3-5","date":"2025-03-17T00:00:00.000Z","categories":["emails"],"authors":["Alan Day"],"tags":["Select Board 3->5"],"draft":false},"content":"This is a notice we were requested to send out to encourage people to attend this hearing.  \nAlan Day\n\n#### Public Hearing on the Select Board 3v5 Question \nOn Thursday, March 27th, the Town Governance Study Committee will be hosting a public hearing to discuss the question of increasing Weston's Select Board from three members to five. The committee has been researching this question ahead of other issues within its charge and an article will be included in the May Annual Town Meeting warrant.\n\nThe hybrid meeting on the 27th will be held at the Weston Police Station at 7pm. The meeting link will be provided on the hearing agenda. During the meeting, the committee will present its research to date. Resident discussion regarding this question will provide additional information for the committee before it makes its recommendation.\n\nThe Select Board charged the Town Governance Study Committee to research this potential change to Weston's executive branch, as well as other aspects of Weston's government. This was in order to provide full information to all registered voters after an advisory Citizens' Petition passed at the 2022 Annual Town Meeting. If the article in May passes, a ballot vote will also required before the increase can occur.\n\nKara Fleming  \nWeston Town Governance Study Committee\n","slug":"2025-03-17-governance-study"},{"frontmatter":{"title":"MBTA Communities Act Timeline","description":"MBTA Communities Act Timeline","date":"2025-04-22T00:00:00.000Z","categories":["emails"],"authors":["Nancy Piedra"],"tags":["MBTA 3A"],"draft":false},"content":"Key milestones and legal developments shaping the implementation of the multifamily housing zoning law.\n\n#### January 2021: MBTA Communities Act becomes law \nPassed in 2021 as part of a broad economic package (143-3 in the State House of Representatives and 40-0 in the State Senate), the MBTA Communities Act requires cities and towns served by the Massachusetts Bay Transportation Authority (MBTA) to create zoning districts that allow multifamily housing by right near transit stations. This law aims to address the state's housing crisis by encouraging higher-density housing in well-connected areas.\n\nCurrent state of compliance in Massachusetts towns:  \n119     Compliance plan submitted and/or approved  \n24        Need to submit compliance plans by July 2025 (includes Weston)  \n28        Need to submit compliance plans by Dec 2025  \n4          Not in compliance (missed deadline)\n\n#### February 2024: The Milton Case: A Challenge to State Authority\nThe case arose when the town of Milton, which has four MBTA stations, rejected a zoning proposal designed to comply with the Act. The Attorney General sued to enforce the law, leading to the SJC ruling that reaffirmed the state's authority to impose such zoning requirements.\n\n#### April 2024: Weston begins public process to develop plan\nWeston launched a public process to develop a zoning plan that complies with the MBTA Communities Act. Thirteen workshops, office hours, strategy sessions and public hearings were held between April 2024 and November 2024.\n\nInformational Workshop 1                April 29, 2024  \nMapping Workshop 1                      May 21, 2024  \nMapping Workshop 2                      June 13, 2024  \nMapping Workshop 2*                     June18, 2024  \nOffice Hours                            June 25, 2024  \nOffice Hours                            July 10, 2024  \nOffice Hours                            July 16, 2024  \nZoning Strategy Workshop                July 22, 2024  \nZoning Strategy Presentation            September 12, 2024  \nZoning Bylaw Presentation               September 25, 2024  \nPublic Hearing 1                        October 16, 2024  \nPublic Hearing 2                        November 6, 2024             \nPublic Hearing 3                        November 20, 2024  \n\n#### October 2024: Healy announces Catalyst Fund\nGovernor Healy announces the $15M Catalyst Fund, a new program offering grants to support local housing and infrastructure projects — but only for cities and towns that comply with the multi-family zoning law. For example, the Town of Lincoln was granted $430,000 for the design phase of a water main extension servicing its 3A district.\n\n#### December 2024: Weston Votes\nAt Town Meeting on December 3rd 2024, the town voted on the proposed by-law change. The proposed zoning bylaw was defeated at Town Meeting, with 195 votes in favor and 544 opposed.\n\n#### January 2025: Key Ruling: MBTA Communities Act is Constitutional\nOn January 8, 2025, the Massachusetts Supreme Judicial Court (SJC) ruled in favor of the state, affirming the constitutionality of the MBTA Communities Act. The decision confirms the state's authority to mandate zoning changes that encourage multifamily housing near public transit stations. The court also upheld the Attorney General’s power to enforce compliance with the law.\n\nWhile the court upheld the law itself, it found that the Executive Office of Housing and Livable Communities (EOHLC) failed to follow the Administrative Procedure Act (APA) when issuing compliance guidelines. Because proper notices and impact statements were not filed, the court deemed the guidelines ineffective, requiring the HLC to reissue them properly.\n\nFollowing the ruling, the HLC announced it would issue new regulations through emergency action. Municipalities that missed previous deadlines must now submit an action plan by February 13, 2025 and apply for a determination of district compliance by July 14, 2025.\n\n#### February 2025 – Unfunded mandate\nSeveral towns in Massachusetts are challenging the MBTA Communities Act on the grounds that it imposes an \"unfunded mandate.\" This means the state is requiring municipalities to change their zoning laws—often to allow for more multi-family housing—without providing sufficient funding to cover the associated costs, such as infrastructure upgrades or expanded public services. While the state argues it has offered grants and technical support, some local officials believe these resources fall short of what’s needed to comply.\n\n#### April 2025 – Regulations become permanent\nFollowing a public comment period, EOHLC filed permanent regulations on March 28, and the Secretary of the Commonwealth published the permanent regulations on April 11.\n\n#### May 2025 – The town will vote on the plan to comply\nThe Town will submit a plan for compliance at Town Meeting on May 5th.\n\n#### July 2025 – The town must be in compliance\nThe Town must comply by July 14, 2025\n\n##### What Happens if a Town Does Not Comply?\nMunicipalities that fail to comply with the MBTA Communities Act face significant consequences, including:\n\n* Loss of State Grants: Non-compliant towns are ineligible for key state funding programs, including the Housing Choice Initiative, Local Capital Projects Fund, and MassWorks Infrastructure Program. These grants support infrastructure improvements, affordable housing projects, and economic development.\n* Legal Action from the Attorney General: The SJC ruling confirmed that the Attorney General has the authority to sue municipalities that refuse to comply, as demonstrated in the Milton case.\n* Potential Developer Lawsuits: Developers may challenge a town’s zoning restrictions if they believe the town is unlawfully preventing multifamily housing development.\n* Increased State Scrutiny: Non-compliant towns may face additional oversight and pressure from state agencies, which could impact future funding opportunities and planning initiatives.\n\nThese penalties underscore the importance of timely compliance, as failing to act could result in financial and legal consequences for municipalities.\n\nSincerely,  \nNancy Piedra\n","slug":"2025-04-22-mbta-3a-timeline"},{"frontmatter":{"title":"Governance Study Committee Letter to the Editor","description":"Governance Study Committee Letter to the Editor","date":"2025-04-30T00:00:00.000Z","categories":["emails"],"authors":["Alice Benson"],"tags":["Select Board 3->5"],"draft":false},"content":"This is a letter from Harvy Boshart, Chair of the Governance Study Committee regarding their analysis of the issue of expansion of the Select Board from 3 to 5 members.\n\nWe are not taking a stand on this issue, but believe that voters should have all the information available about this issue and not only opinions in opposition to the report.\n\nThe full report can be found on the Town's website at:\nhttps://www.westonma.gov/DocumentCenter/View/40091/Final-TGSC-Report-with-Apps-PDF\n\nengageWeston Team\n\n---\n\n#### Letter to the Editor\nApril 27, 2025\n\nTo the Editor:  \nThe Town Governance Study Committee (TGSC) has recently concluded its in-depth review of whether Weston’s Select Board should expand from three to five members. This important study, initiated by a non-binding citizens' petition at the 2022 Annual Town Meeting, spanned more than a year and involved extensive research, public input, and a thorough examination of governance practices across Massachusetts towns.\n\nAfter this comprehensive process, the TGSC voted unanimously (5-0, with one abstention) not to recommend expanding the Select Board at this time. This decision rests on several key findings, shaped by both Weston’s unique characteristics and broader lessons from other communities:\n\n* <strong>Low Civic Participation</strong>: Voter turnout in Weston averages just 13.5% for Town Elections, and only 5.5% of registered voters attend Annual Town Meetings. Between 2014 and 2025, only 45% of Select Board races were contested. These numbers reflect limited public engagement—raising concerns about whether there is enough interest to support additional board members.\n\n* <strong>Volunteer Shortages</strong>: Town officials consistently report difficulties filling both elected and appointed positions. Adding two more seats to the Select Board could further strain an already limited pool of volunteers. Rather than expanding leadership positions, the TGSC recommends redoubling efforts to strengthen volunteer outreach and engagement.\n\n* <strong>Mixed Outcomes in Other Towns</strong>: While 82% of similarly sized Massachusetts towns have five-member boards, many are in counties with different regional complexities (from industry, tourism, agriculture, etc. to name a few) and growth patterns making it difficult to compare to an established bedroom community. The TGSC found no clear link between board size and population growth, density or the strength of a town administrator. In fact, interviews and studies revealed that larger boards often experience longer meetings, more internal conflict, increased strain on Town Manager offices, and minimal gains in decision-making efficiency. Some towns also reported higher rates of Open Meeting Law violations and public records requests following expansion. Further confusing, it was determined that most of the towns with five Select Board members moved to a town manager form of government later on.\n\n* <strong>Transparency Concerns</strong>: A five-member board would allow any two members to discuss town business privately without violating the Open Meeting Law—something not possible with a three-member board. It would be possible for any one member to have conversations on town matters with the other board members individually out of public discussion. While some see this as a practical advantage, the TGSC views it as a potential risk to Weston’s tradition of open, public deliberation.\n\n* <strong>Stable Population</strong>: Weston’s population has remained stable, growing only modestly from 11,555 in 2000 to 11,718 in 2025. Regional forecasts predict no significant growth through 2050. Without substantial population increase, there is no pressing need to expand the board.\n\n* <strong>Strong Existing Governance Structure</strong>: Since 2000, Weston has operated under a professional Town Manager system, delegating daily operations to trained staff. This model reduces the Select Board’s operational burden and allows members to focus strategically, further lessening the need for additional board members. The Select Board has a longstanding policy for a rotating chair in order to provide balance on the board and having everyone serve as chair. This would not be possible under a five member board.\n\nThe TGSC firmly believes that changes to a town’s government should be driven by local needs—not simply by trends elsewhere.\n\nInstead of expanding the board, the committee urges Weston to:\n* Improve communication and outreach to residents\n* Strengthen volunteer recruitment\n* Monitor civic engagement trends over time\n* Reconsider board size only if substantial future changes warrant it\n\nImportantly, through resident surveys, two public hearings, and interviews with neighboring towns, the TGSC has helped bring essential information to light. Whether one supports or opposes expanding the Select Board, we can all agree that Weston is now far better informed than when this conversation began. The committee’s work has laid the groundwork for a more thoughtful and informed debate at Town Meeting.\n\nThe question of whether to expand the Select Board will come before voters at the 2025 Annual Town Meeting. I encourage every resident to review the TGSC’s full report, available on the town website, and to attend Town Meeting on May 5th at 7 p.m.\n\nRegardless of where we stand individually, the TGSC’s work stands as an example of good governance: thorough, transparent, and resident-centered. Now, it’s up to us—to listen, reflect, and make our voices heard.\n\nSincerely,  \nHarvey Boshart  \nOn Behalf of the Town Governance Study Committee\n\n","slug":"2025-04-30-select-board-3-5"},{"frontmatter":{"title":"NEWS ABOUT TOWN MEETING ARTICLE 14 – MBTA COMMUNITIES ACT –3A","description":"NEWS ABOUT TOWN MEETING ARTICLE 14 – MBTA COMMUNITIES ACT –3A","date":"2025-05-01T00:00:00.000Z","categories":["emails"],"authors":["Nancy Piedra"],"tags":["MBTA 3A"],"draft":false},"content":"At Weston’s upcoming Town Meeting on May 5th, residents will not have the opportunity to vote on the proposed zoning by-law change required for compliance with the MBTA Communities Act. (see https://www.westonma.gov/CivicAlerts.aspx?AID=1106)\n\nThere are many passionate views and opinions on the 3A zoning effort. Our goal is not to debate those perspectives now, but to ensure Weston residents understand why the proposed plan was not brought to a vote at Town Meeting — and what the potential consequences could be of missing the State’s July 14, 2025 deadline.\n\nUnder Massachusetts law, if the Planning Board votes against a proposal that is not substantially different from one presented at Town Meeting within the past two years, the Article cannot be brought to Town Meeting.  At last week’s Planning Board meeting, the Board voted against the current 3A plan that had been created and proposed.. With one vacancy and one member absent, the vote failed 2 to 1, which means that the Article cannot proceed to Town Meeting.\n\nMultiple reasons have been cited for the rejection. Here are the most prominent:\n\n- <strong>Not enough time</strong>. There was not enough time to put together an alternative plan that works. (The law has been in place since 2021).\n- <strong>Rejection in December</strong>. The plan was defeated at the December Town Meeting. At that time, many residents may have been taking a “wait-and-see” approach, anticipating the SJC ruling in the Milton case. Given the presentation at Town Meeting, it is not clear if residents were voting against the concept of the law, to wait for the Milton case result, or the actual plan that was put forward by the Town.\n- <strong>Hope for a better plan</strong>. The hope mentioned recently is that the Planning Board can create a better plan to present at a future Town Meeting that would reduce opposition and win more support. However, the State has made clear that failure to meet the July 14, 2025 deadline for filing a plan could carry significant consequences, well beyond the statutory penalties, for noncompliant towns.\n- <strong>Unfunded mandate lawsuit</strong>. The Town has filed a lawsuit against the state in hopes of delaying enforcement while the town works on an updated 3A plan, claiming the MBTA Communities Act is an unfunded mandate. Most legal experts have concluded that this argument is unlikely to succeed. An example from Klein Hornig (a law firm that deals with these issues):\n\n    -  “In sum, it is our view that the Opinion’s unfunded mandate determination regarding Section 3A is unfounded. By DLM’s own admission, it has not investigated—let alone found evidence of—a necessary element of the unfunded mandate test: costs imposed on a particular municipality by the law in question... The lawsuits inspired by the Opinion are no more likely to succeed than Milton’s ill-fated challenge to Section 3A... MBTA Communities that embrace Section 3A can rest assured that they are saving their constituents significant litigation expenses. And those constituents can be proud that their communities are doing their part to combat the affordable housing crisis.”\n\n#### Massachusetts 3A Compliance, as of April 30\n177 Towns need to comply with the MBTA Communities Act—\n\n123 Towns have already created compliant by-laws  \n25 Towns need to comply by July-14-2025 (includes Weston)  \n25 Towns need to comply by Dec-31-2025 (adjacent small towns)  \n4 towns are not compliant due to missed deadlines (Halifax, Marshfield, Middleton, Milton)\n\n#### What Comes Next\n\nOn Wednesday April 30th, the Select Board sent out a notification to residents, announcing the cancellation of the vote on Article 14. (see link in the first paragraph)\n\n#### Where Weston Stands\nAs of now, Weston does not have an approved 3A zoning plan before the State’s July 14 deadline. Without an adopted plan by that date, Weston will be considered non-compliant and could face state sanctions. Although an updated plan is being discussed, there has been no public effort yet to build community support or lay the groundwork for its approval and an updated plan by itself may or may not generate greater support. Meanwhile, the Town’s lawsuit claiming the law is an unfunded mandate has uncertain prospects and may not delay enforcement.\n\nWhat do you think Weston should do next on this consequential law?  We’d love to hear your thoughts.\n\nSincerely, \nNancy Piedra, Alice Benson, Tom Timko, Alan Day\n","slug":"2025-05-01-mbta-3a-town-meeting-vote"},{"frontmatter":{"title":"Court Rejects Weston's 3A MBTA Multifamily Lawsuit","description":"Court Rejects Weston's 3A MBTA Multifamily Lawsuit","date":"2025-06-07T00:00:00.000Z","categories":["emails"],"authors":["Nancy Piedra"],"tags":["MBTA 3A"],"draft":false},"content":"#### Court Dismisses Unfunded Mandate Lawsuit Over MBTA Communities Act;\n#### Weston Still Out of Compliance\n\nA Superior Court judge has dismissed a lawsuit brought by Weston and several other communities claiming that the MBTA Communities Act imposes an unconstitutional unfunded mandate. The decision reaffirms the state’s authority to require towns with MBTA service or proximity to provide zoning for multi-family housing as part of the 2021 law aimed at easing the state’s severe housing shortage.\n\nJudge Mark Gildea dismissed the towns’ claims as lacking sufficient evidence, noting that they failed to present concrete examples of the costs that multifamily housing would impose. “The Municipalities have neither pled specific costs for anticipated infrastructure costs, nor provided any specific timeline for anticipated construction projects,” Gildea wrote in the ruling. “Instead, the only allegations and averments before the court are generalized comments about large-scale they foresee, which are insufficient to sustain the Municipalities’ claims.”\n\n##### Weston Remains Out of Compliance\n\nAs of early June 2025, 134 towns have passed compliant zoning bylaws. Another 18, including Weston, still need to act. Three communities have missed previous deadlines and are considered non-compliant.\n\nWeston's challenge is particularly acute: the deadline to adopt a compliant zoning bylaw is July 14, 2025, but the Town currently has no Town Meeting scheduled until November.\n\nIn addition to the loss of eligibility for certain state grants, non-compliant communities may face further consequences. The Massachusetts Attorney General&#39;s Office has indicated that failure to comply with the MBTA Communities Act could result in civil enforcement actions and potential liability under federal and state fair housing laws. This underscores the state's commitment to ensuring that all MBTA communities fulfill their obligations under the law.\n\n##### Statewide Compliance Status\n\nBelow is a breakdown of how communities are progressing toward meeting the MBTA Communities Act requirements:\n\n- 134 towns have passed compliant bylaws\n- 18 towns still need to adopt bylaws by the July 14, 2025 deadline\n- 3 towns are non-compliant\n\n![compliance status](./images/compliance-status.png)\n","slug":"2025-06-07-unfunded-mandate"},{"frontmatter":{"title":"Weston MBTA 3A Multifamily Zoning Planning Update","description":"Weston MBTA 3A Multifamily Zoning Planning Update","date":"2025-06-09T00:00:00.000Z","categories":["emails"],"authors":["Alan DAy"],"tags":["MBTA 3A"],"draft":false},"content":"\nEngageWeston’s current assessment of the MBTA 3A issue in Weston is that the Select Board and Planning Board 3A Working Group is working well in developing the best 3A plan possible, but still has no planned effort to educate enough voters about the need to approve that plan sufficient to assure it will likely be approved when it’s voted on in November, the next scheduled Town Meeting.\n\nFirst, let’s analyze the 3A plan development efforts then look at the voter education strategy.\n\nThe 3A Working Group, the combined Select and Planning Boards, is working diligently to craft a plan that they hope the town will approve. Again, their actions seem based on the conclusion that Weston will not be allowed by the state to avoid the law without consequences the town finds too onerous to accept. Weston just lost it’s case against 3A claiming it is an unfunded mandate. Milton and other towns lost their cases, with the courts concluding repeatedly that 3A is legal and binding and the Attorney General has the authority to enforce the law.\n\nThe 3A Working Group’s approach to crafting a plan that will bring Weston into legal compliance involves attempting to calm unhappy neighbors of proposed multifamily zones as much as possible while still maintaining their strategies to minimize the overall disruption in the town’s character. \n\nThose strategies are to rezone already developed commercial and multifamily areas and to avoid rezoning residential areas or open space that would likely be disruptive to existing single family residential neighborhoods.\n\nTheir latest thoughts on changes to the proposed December Town Meeting 3A plan is to reduce the number of proposed units zoned for the old Liberty Mutual campus off Rt. 30 and to move those proposed units to the Merriam Village site as well as to the 751 Boston Post Rd. development that is currently being constructed. If adopted, those changes would reduce the allowable units at the Liberty Mutual site from around 250 to 75, allow Merriam Villlage’s existing 62 apartments to expand to around 100 on undeveloped land Merriam Village owns next to their existing buildings, and to count 100 of the 170 apartments being built at 751 BPR for 3A purposes. \n\nMerriam Village is a non-profit organization offering the most substantial affordable elderly housing campus in town, and this change could allow it to add new apartments in the future to accommodate its long waiting list, though. Merriam Village has no plans to explore expansion currently, but rezoning their excess land is the only fully publicly spirited  change included in the 3A plan.\n\nThe 751 BPR development would not change the current construction plan in the Working Group’s plan as the new 3A zone would authorize fewer apartments than are already being developed under the 40b state program. The developer would not restart its current plan to adopt 3A zoning authorization without losing a huge amount of profit because they could build fewer apartments under the proposed 3A plan. \n\nThe 3A Working Group is also exploring how the Boston Property 3A zone there can be spread out across more of the 133 Boston Post Rd. campus than the current plan which mainly uses the area near the rail trail. \n\nThe 3A zone proposed for Merriam Village is the only zone in the plan that would be focused 100% on elderly and affordable housing, which is in very short supply but in great need by a good number of town residents. By contrast, under 3A up to only 20% of other 3A zones could be required to be affordable and none could be required to focus on elderly residents.\nAgain, the 3A Working Group is working very hard and quickly to craft a plan that will cause the least resistance among the neighborhoods next to proposed multifamily housing zones.\n\n#### Voter Education Plan Missing\n\nHowever, so far it appears what’s missing is a plan to educate the voters to help them understand the situation well enough to overcome the misinformation and misunderstanding surrounding the law among town residents. The vote in December’s Town Meeting was 544 against and 194 in favor of the 3A proposal. Given this significant discrepancy, without a concerted campaign to educate voters all the 3A Working Group’s efforts to craft as good a plan as possible risk being inadequate to the task of convincing enough voters to change their opinions. \n\nThe 3A team seems to be strongly in favor of the town becoming compliant with 3A, however reluctantly some previous opponents have become apparent supporters. That’s a substantial change from December. They are using normal deliberative town processes of public meetings, public hearings, neighborhood meetings, and site walks to craft an updated plan in full public view and with every step thoroughly documented on the town’s website. However, it seems nearly the only people watching all that good work are civic affairs enthusiasts like us or some of the 3A adjacent neighborhood residents. \n\nWe believe an additional and substantial public education effort is needed if the town voters are to understand the situation well enough to make a wise decision on 3A when it comes to a vote in the newly scheduled Fall Town Meeting in November. With no comprehensive plan or dedicatged effort to educate the voters adequately, we believe the 3A plan will be doomed to fail. If it fails again the State has been quite clear that the repercussions would be painful and extensive, far exceeding the explicit penalties listed in the 3A act itself.   Such a result would be unnecessarily expensive in many, many ways for the town and risk putting the direction of the town’s zoning and development planning in the hands of the court instead of our elected local officials. \n\nWe strongly encourage the 3A Working Group to develop a voter education plan that is up to the task of avoiding these negative consequences.\n\nSincerely,  \nengageWeston Team\n","slug":"2025-06-09-joint-board"},{"frontmatter":{"title":"Milton & Duxbury Now Compliant with MBTA Communities Law","description":"Milton & Duxbury Now Compliant with MBTA Communities Law","date":"2025-06-18T00:00:00.000Z","categories":["emails"],"authors":["Nancy Piedra"],"tags":["MBTA 3A"],"draft":false},"content":"\nDear Engage Weston Readers,  \nWe’re pleased to share two important updates on the MBTA Communities Act:\n\n#### Milton Votes Yes\n\nAfter a tense two-night debate, Milton’s Town Meeting voted 69 percent to 31 percent in favor of a citizen-petitioned zoning plan aimed at adding capacity for approximately 2,461 multi-family units—equaling 25 percent of the town’s existing housing stock. This vote brings Milton into full compliance with the MBTA Communities law, ending a drawn-out process that included prior rejections, legal challenges (including a Supreme Judicial Court ruling affirming the law’s constitutionality), and a heated community dialogue.\n\n[Read more in Commonwealth Beacon](https://commonwealthbeacon.org/housing/milton-town-meeting-decides-to-comply-with-mbta-communities-law/)\n\n#### Duxbury Gets on Board\n\nDuxbury also secured compliance at a recent Special Town Meeting. Voters approved the MBTA Communities overlay zoning by a clear margin—255 in favor, 152 opposed—completing the town’s second attempt to meet the state’s requirements. Notably, Duxbury used the same attorney as Weston in the recently dismissed unfunded mandate lawsuit.\n\n[Read more in the Duxbury Clipper](https://www.duxburyclipper.com/articles/stm-approves-mbta-zoning/)\n\n#### What This Means for Weston\n- Milton and Duxbury are now compliant, joining the growing list of communities meeting the July 14 deadline under the State’s emergency regulations.\n- Their actions underscore that legal challenges have not succeeded—and that timely, community-driven zoning updates are the clearest path forward.\n- With no Town Meeting scheduled until November, Weston remains at risk of non-compliance, which could trigger profound legal and financial consequences from the state.\n\n#### Latest compliance\n140 towns have passed compliant bylaws  \n13 towns still need to adopt bylaws by the July 14, 2025 deadline  \n3 towns are non-compliant  \n\n![compliance image](./images/mbta_communities_compliance_pie_chart_140.png)\n\nThank you for staying engaged. We’ll continue to track Weston’s progress and provide updates on what actions may be needed before the July 14 deadline.\n\nWarm regards,  \nThe Engage Weston Team\n\n","slug":"2025-06-18-milton-duxbury"},{"frontmatter":{"title":"Why Housing in Massachusetts Should Matter to Each of Us","description":"Why Housing in Massachusetts Should Matter to Each of Us","date":"2025-06-21T00:00:00.000Z","categories":["emails"],"authors":["Alice Benson"],"tags":["MBTA 3A"],"draft":false},"content":"\nAs a Weston resident and professionally as an executive search business leader for over 20 years, I have seen over that time, a change in tone from businesses and leaders, about investing in Massachusetts. This is about building their business here or for leaders, considering moving to the Commonwealth. The cost of living, primarily driven by housing costs, is giving them pause and we need to be concerned about that impact on the long-term economic health of the state.\nMassachusetts stands at an economic crossroads. Once a magnet for talent thanks to its world-class universities, cutting-edge industries, and vibrant cities, the Commonwealth now faces a formidable obstacle: a severe housing shortage. With median home prices exceeding $722,000 and rents rising nearly 30% faster than incomes, many working professionals are being priced out. Between 2020 and 2022 alone, over 110,000 residents left the state in search of affordability, eroding the very workforce that powers key sectors in our economy.\n\nThis is a drag on economic growth. The U.S. Chamber estimates Massachusetts loses around $13.5 billion in output and nearly 91,000 jobs annually due to its housing constraints. Meanwhile, employers report difficulty filling positions because candidates simply can’t find a place to live. Its clear--housing is central to economic vitality.\n\nThat’s why lawmakers and business leaders are mobilizing. The Healey‑Driscoll Affordable Homes Act alone pledges $4 billion to build over 40,000 new homes, creating 30,000 jobs, unlock $10 billion in funding, and inject $25 billion into the state economy over five years. Achieving the goal of 200,000 new units by 2030 is not merely a housing agenda—it’s an economic imperative.\n\nThe Massachusetts Business Roundtable, a statewide public policy organization comprised of Chief Executive Officers and Senior Executives from some of the state’s largest employers, recently released the survey results of its 2024 Talent and Competitiveness Survey, a survey the Roundtable has conducted in partnership with McKinsey & Company over the past four years. The survey found that Massachusetts is an attractive home for business with talent continuing to be the top reason employers are here. However, the rising costs of living and doing business have emerged as dominant factors influencing employers’ hiring decisions and whether to remain and/or grow outside of the Commonwealth. “What struck me most about the survey results was the acceleration of the impact of the state’s cost of living on employer’s hiring and growth decisions,” said JD Chesloff, President & CEO of the Roundtable. “Employers still love being in Massachusetts for all it has to offer, however the cost of living and fundamental changes in mobility have given employers alternatives that they are exploring.”\n\nThe survey found that Massachusetts continues to be a hub for education and technological innovation. However, macroeconomic headwinds outweigh tailwinds as factors influencing where employers are growing their workforce and footprint. The rising cost of living, led by the cost of housing, is the dominant factor influencing organizations’ decisions to remain in Massachusetts.\n\nOf those employers surveyed, 83% cited the cost of living – driven by the cost of housing – as critical to their decision to remain in Massachusetts, up 2.5x from 2022 and more than 50% indicated the largest hurdle to recruiting is candidates’ unwillingness to move to Massachusetts. This has resulted in 40% of respondents planning to grow their workforce outside of the state, doubling since 2023 and almost 6x from 2022.\n\nTo learn more, read the full Competitiveness and Talent survey results at [https://www.maroundtable.com/issue-based-reports/](https://www.maroundtable.com/issue-based-reports/)\n\nOur growth is slowing in comparison to other states. According to the Pioneer Institute’s June 2025 brief,\n- From 2020 to 2024, Massachusetts’ private sector per capita real GSP grew by 12.5 percent, well below the national average of 13.3 percent, and significantly behind Florida (26 percent), Texas (22.3 percent), and North Carolina (17.4 percent).\n- The state’s per capita real GSP growth fell from fourth fastest in the nation (1998–2019) to 28th fastest (2020–2024).\n\nTo learn more from the Pioneer brief, [https://pioneerinstitute.org/economic_opportunity/new-report-shows-massachusetts-has-been-in-economic-slow-down-since-2020](https://pioneerinstitute.org/economic_opportunity/new-report-shows-massachusetts-has-been-in-economic-slow-down-since-2020)\n\nTo combat this negative impact on the long-term economic health of Massachusetts, it’s critical that all communities do their part helping ease some of the housing costs burden by thoughtfully increasing the housing stock.\n\n\nIn Weston, adding thoughtfully planned, attractive multifamily housing, which fits into the character of the town, will support all our interests in the continued strong economic health of Massachusetts. We need to do our part so all of us and our families can continue to thrive economically in the Commonwealth.\n\nSincerely,  \nengageWeston Team  \nAlice Benson, Nancy Piedra, Tom Timko, Alan Day\n\n\n","slug":"2025-06-21-why-housing"}]